# -*- coding: utf-8 -*-
"""
@Author: lizuojun
@Date: 2019-11-15
@Description: 智能布局接口

"""

# 布局算法模式 整体布局
LAYOUT_MODE_TRANSFER = 0  # 迁移布局
LAYOUT_MODE_PROPOSE = 1  # 推荐布局
LAYOUT_MODE_SCHEME = 2  # 方案布局
LAYOUT_MODE_ADJUST = 3  # 调整布局
LAYOUT_MODE_ADVICE = 4  # 参考布局
LAYOUT_MODE_SPLIT = 5  # 裂变布局
# 布局算法模式 局部布局
LAYOUT_MODE_GROUP = 10  # 组合布局
LAYOUT_MODE_PAINT = 11  # 铺贴布局
LAYOUT_MODE_SEEDS = 12  # 种子布局
# 布局算法模式 单品布局
LAYOUT_MODE_ADORN = 20  # 配饰布局
LAYOUT_MODE_INNER = 21  # 内空布局
# 布局算法模式 机位布局
LAYOUT_MODE_CAMERA = 30  # 机位布局


# 布局算法接口 单屋信息
room_data_example = {
    # 房间ID
    'id': 'Bedroom-8905',
    # 房间类型 不为空
    'type': 'Bedroom',
    # 房间风格
    'style': '',
    # 房间面积 平方米
    'area': 13.119835985397998,
    # 房间高度
    'height': 2.6,
    # 房间轮廓 点列
    'floor': [-2.422451, 5.087374, -2.422451, 1.39815, -4.96428, 1.39815, -5.640086, 2.209117, -5.640086, 5.089123,
              -4.974437, 5.688207, -3.123423, 5.688207],
    # 房门列表 包含底部轮廓、通向房间
    'door_info': [
        {
            'pts': [-2.182451, 1.9671657089999999, -2.422451, 1.9671657089999999, -2.422451, 1.549144291, -2.182451,
                    1.549144291],
            'to': 'Bathroom-8745'
        }
    ],
    # 门洞列表 包含底部轮廓、通向房间
    'hole_info': [],
    # 窗户列表 包含底部轮廓、底部高度和通向房间
    'window_info': [
        {
            'pts': [-2.510811736406455, 5.163111580198101, -2.3546218056480064, 5.345333163798044, -2.944156263593545,
                    5.850648419801899, -3.1003461943519937, 5.668426836201956],
            'to': '',
            'height': 0.85
        },
        {
            'pts': [-4.943091004583534, 5.71641850256051, -5.103642538629196, 5.894809099049184, -5.710090995416465,
                    5.3490054974394905, -5.549539461370803, 5.170614900950816],
            'to': '',
            'height': 0.85
        },
        {
            'pts': [-5.59872840678359, 2.1594876814546735, -5.783101514134378, 2.0058434258321003, -5.2269555932164105,
                    1.3384683185453263, -5.042582485865623, 1.4921125741678996],
            'to': '',
            'height': 0.85
        }
    ],
    # 飘窗列表 包含底部轮廓、底部高度和通向房间
    'baywindow_info': [],
    # 家具列表 包含已有家具ID、类目、风格、尺寸（厘米）、缩放、位置、旋转
    'furniture_info': [
        {
            'id': 'dbadb75c-5d0c-4dd5-8ea9-68b3e85fcdf4',
            'type': 'media unit/floor-based media unit',
            'style': '简欧/新古典',
            'size': [1.6519900512695314, 0.44962501525878906, 0.6917120361328125],
            'scale': [1, 1, 1],
            'position': [-2.6472635076293947, 3.503852089508672, -3.828356585026126e-18],
            'rotation': [0, 0, 89.99999999999993],
            'entityId': '30489'
        }
    ],
    # 硬装列表
    'decorate_info': [
        {
            'id': '',
            'type': '',  # 背景墙 吊顶 定制橱柜
            'style': '',
            'size': [
                2.1500399780273438,
                0.786095962524414,
                0.8624019622802734
            ],
            'scale': [
                1,
                1,
                1
            ],
            'position': [
                0.0,
                0,
                0.0
            ],
            'rotation': [
                0,
                0,
                0
            ],
            'entityId': 'test entity id'
        }
    ],
    # 替换列表
    'replace_info': [],
    # 坐标系统 design文件的xyz为标准坐标
    'coordinate': 'xyz',
    # 单位系统 默认米
    'unit': 'm'
}
# 布局算法接口 全屋信息
house_data_example = {
    'id': '',
    'room': [
        room_data_example
    ]
}

# 布局算法接口 参数说明
smart_decoration_input_layout = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'house_data': {},  # 全屋信息
    'room_data': room_data_example,  # 单屋信息
    'house_replace': {},  # 替换信息
    'layout_number': 2,  # 布局方案数量
    'propose_number': 3,  # 选品方案数量
    'sample_house': '',  # 样板户型ID
    'sample_room': '',  # 样板房间ID
    'data_idx': 0,  # 目标户型数据序号
    'data_url': '',  # 目标户型数据地址
    'scene_url': '',  # 目标户型场景地址
    'image_url': '',  # 目标户型图片地址
    'design_id': '',  # 模板方案设计ID
    'layout_mode': 1,  # 服务方式 0迁移布局 1推荐布局 2方案布局 3微调布局 4布局特征 10局部布局
    'scheme_mode': 'frame layout propose'  # 存储方式
}
# 布局算法接口 参数说明
smart_decoration_output_layout = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'layout_number': 3,  # 布局方案数量
    'propose_number': 3,  # 选品方案数量
    'layout_scheme': {
        'LivingDiningRoom-10878': [
            # 家具列表 包含ID、类目、风格、尺寸（厘米）、缩放、位置、旋转
            [
                {
                    'id': 'd7ab9ef0-41f0-4e46-befa-a580aea346ba',
                    'type': 'sofa/ multi seat sofa',
                    'style': 'chinese modern',
                    'size': [
                        215.00399780273438,
                        78.6095962524414,
                        86.24019622802734
                    ],
                    'scale': [
                        1,
                        1,
                        1
                    ],
                    'position': [
                        0.0,
                        0,
                        0.0
                    ],
                    'rotation': [
                        0,
                        0.0,
                        0,
                        1.0
                    ],
                    'entityId': ''
                },
                {
                    'id': '9ea8c214-7bf9-46cd-973f-e7662aeda87a',
                    'type': 'table/side table',
                    'style': 'chinese modern',
                    'size': [
                        62.5007,
                        54.9613,
                        62.5117
                    ],
                    'scale': [
                        0.86594,
                        1,
                        0.86581
                    ],
                    'position': [
                        -1.33502,
                        0,
                        -0.17120000000000024
                    ],
                    'rotation': [
                        0,
                        0.0,
                        0,
                        1.0
                    ],
                    'entityId': ''
                },
                {
                    'id': '9ea8c214-7bf9-46cd-973f-e7662aeda87a',
                    'type': 'table/side table',
                    'style': 'chinese modern',
                    'size': [
                        62.5007,
                        54.9613,
                        62.5117
                    ],
                    'scale': [
                        0.86594,
                        1,
                        0.86581
                    ],
                    'position': [
                        1.33502,
                        0,
                        -0.17120000000000024
                    ],
                    'rotation': [
                        0,
                        0.0,
                        0,
                        1.0
                    ],
                    'entityId': ''
                }
            ]
        ]
    },
    'layout_scheme_id': [],
    'layout_scheme_url': ''
}

# 布局样板接口 参数说明
smart_decoration_input_sample = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'house_data': {},  # 全屋信息
    'room_data': {},  # 单屋信息
    'room_scene': [],  # 单屋场景
    'house_sample': {},  # 全屋方案
    'room_sample': {},  # 单屋方案
    'house_replace': {},  # 全屋替换
    'room_replace': {},  # 单屋替换
    'note_replace': {},  # 替换说明
    'data_idx': 0,  # 目标户型数据序号
    'data_url': '',  # 目标户型数据地址
    'scene_url': '',  # 目标户型场景地址
    'image_url': '',  # 目标户型图片地址
    'design_id': '',  # 模板方案设计ID
    'scheme_mode': 'frame'  # 存储方式
}
# 布局样板接口 参数说明
smart_decoration_output_sample = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'house_layout': {},  # 全屋布局
    'room_layout': {},  # 单屋布局
}

# 布局调整接口 参数说明
smart_decoration_input_adjust = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'house_data': {},  # 全屋信息
    'room_data': {},  # 单屋信息
    'house_replace': {},  # 替换信息
    'data_idx': 0,  # 目标户型数据序号
    'data_url': '',  # 目标户型数据地址
    'scene_url': '',  # 目标户型场景地址
    'image_url': '',  # 目标户型图片地址
    'design_id': '',  # 模板方案设计ID TODO:
    'layout_mode': 3,  # 智能家装服务方式 0迁移布局 1推荐布局 2方案布局 3调整布局 4布局特征 10局部布局
    'scheme_mode': 'group'  # 软装方案存储方式
}

# 布局组合接口 参数说明
smart_decoration_input_group = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'plat_id': '',  # 目标家具ID
    'house_data': {},  # 全屋信息
    'room_data': {},  # 单屋信息
    'data_idx': 0,  # 目标户型数据序号
    'data_url': '',  # 目标户型数据地址
    'scene_url': '',  # 目标户型场景地址
    'layout_number': 2,  # 布局方案数量
    'propose_number': 3,  # 选品方案数量
    'layout_mode': 10,  # 智能家装服务方式 0迁移布局 1推荐布局 2方案布局 3调整布局 10组合布局 20配饰布局
    'scheme_mode': 'group'  # 软装方案存储方式
}
# 布局配饰接口 参数说明
smart_decoration_input_adorn = {
    'house_id': '',  # 目标户型ID
    'room_id': '',  # 目标房间ID
    'plat_id': '',  # 目标家具ID 必填
    'house_data': {},  # 全屋信息
    'room_data': {},  # 单屋信息 必填 类型 风格 面积 和 furniture_info
    'layout_number': 2,  # 布局方案数量
    'propose_number': 3,  # 选品方案数量
    'layout_mode': 20,  # 智能家装服务方式 0迁移布局 1推荐布局 2方案布局 3调整布局 10组合布局 20配饰布局
    'scheme_mode': 'group'  # 软装方案存储方式
}


# 布局算法接口 业务场景:设计家  ##################
pass
# 布局算法接口 测试输入:单屋设计
smart_decoration_input_layout_test_99 = {
    "house_id": "","room_id": "Bathroom-10038","house_data":{},"room_data":{"id": "Bathroom-10038","type": "Bathroom","style": "neoclassical","area":5.169685149129998,"height":2.8,"floor":[-2.711894,0.016176,-5.097763,0.016176,-5.097763,2.146946,-4.144345,2.146946,-4.144345,2.206946,-2.711894,2.206946],"door_info":[{"pts":[-2.591894,1.240235547279,-2.711894,1.240235547279,-2.711894,0.38288245272099997,-2.591894,0.3828824527210001],"to": "MasterBedroom-5346"}],"hole_info":[],"window_info":[{"pts":[-5.097763,1.058450366432,-5.337763,1.058450366432,-5.337763,0.3567136335680001,-5.097763,0.35671363356800007],"to": "","height":0.9}],"baywindow_info":[],"furniture_info":[],"decorate_info":[]},"layout_number":2,"propose_number":3,"sample_house": "","sample_room": "","data_idx":0,"data_url": "","scene_url": "","image_url": "",
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_layout_test_99 = {
    "house_id":"","room_id":"LivingRoom-2000",
    "house_data":{},
    "room_data":{"id":"LivingRoom-2000","type":"LivingRoom","style":"emptyStyle","area":40.335373763621014,"height":2.8,"floor":[-2.825345612501921,-0.9556856225310898,2.65338155102414,-0.9556856225310897,2.653381551024139,-8.317865296698605,-2.825345612501922,-8.317865296698605],"door_info":[{"pts":[-0.08714453678297862,-8.317865296698605,-0.08714453678297862,-8.557865296698603,1.5157754632170215,-8.557865296698603,1.5157754632170215,-8.317865296698605],"to":""}],"hole_info":[],"window_info":[],"baywindow_info":[{"pts":[-2.8253456125019216,-8.317865296698603,-2.8253456125019216,-7.317865296698602,-3.4253456125019217,-7.317865296698602,-3.4253456125019217,-9.076865296698601,-1.8253456125019216,-9.076865296698601,-1.8253456125019216,-8.317865296698603],"to":"","height":0,"indent":0}],"furniture_info":[{"id":"f0d7de0e-4710-41a9-9fe2-72438d825547","type":"sofa/double seat sofa","style":"其他","size":[2.60181,1.0601800000000001,0.893304],"scale":[1,1,1],"position":[2.1232915540869066,-3.76653231219408,0],"rotation":[0,0,90],"entityId":"9121","categories":["a5af8349-bd50-46aa-b97a-2940125aafae"]}],"decorate_info":[]},
    "layout_number":2,"propose_number":3,"sample_house":"","sample_room":"",
    "data_idx":0,"data_url":"","scene_url":"","image_url":"",
    "scheme_mode": "frame layout propose output"
}
# 布局算法接口 测试输入:单屋设计 客厅 餐厅 客餐厅
smart_decoration_input_layout_test_00 = {
    "house_id": "00", "room_id": "LivingDiningRoom-6092", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-6092", "type": "LivingDiningRoom", "style": "other",
                  "area": 41.617573884341994, "height": 2.6,
                  "floor": [4.837053, 1.68478, 2.354332, 1.68478, 2.354332, -3.920837, -1.749219, -3.920837, -1.749219,
                            3.604348, -0.842455, 3.604348, -0.842455, 4.882377, -0.782455, 4.882377, -0.782455,
                            6.000151, 2.034732, 6.000151, 2.034732, 3.299506, 4.837053, 3.299506], "door_info": [{
            "pts": [
                -1.0150955238076402,
                3.604348,
                -1.0150955238076402,
                3.724348,
                -1.70510447619236,
                3.724348,
                -1.70510447619236,
                3.604348],
            "to": "Bathroom-6252"},
            {
                "pts": [
                    -1.869219,
                    2.7004012040557477,
                    -1.7492189999999999,
                    2.7004012040557477,
                    -1.7492189999999999,
                    3.366988795944252,
                    -1.869219,
                    3.366988795944252],
                "to": "SecondBedroom-6214"},
            {
                "pts": [
                    -1.7492189999999999,
                    2.1686895288228607,
                    -1.869219,
                    2.1686895288228607,
                    -1.869219,
                    1.4486564711771392,
                    -1.7492189999999999,
                    1.4486564711771392],
                "to": "MasterBedroom-6189"},
            {
                "pts": [
                    1.6970643,
                    -4.040837000000001,
                    1.6970643,
                    -3.9208370000000006,
                    -0.9515943000000001,
                    -3.9208369999999997,
                    -0.9515943,
                    -4.040837],
                "to": "Balcony-6164"},
            {
                "pts": [
                    3.521649619580002,
                    1.5647799999999998,
                    3.521649619580002,
                    1.68478,
                    2.776058380419998,
                    1.68478,
                    2.776058380419998,
                    1.5647799999999998],
                "to": "Library-6136"},
            {
                "pts": [
                    4.837053,
                    1.86341065,
                    5.077053,
                    1.86341065,
                    5.077053,
                    3.25250935,
                    4.837053,
                    3.25250935],
                "to": ""},
            {
                "pts": [
                    2.154732,
                    4.5160715469161605,
                    2.034732,
                    4.5160715469161605,
                    2.034732,
                    3.8059864530838396,
                    2.154732,
                    3.8059864530838396],
                "to": "Kitchen-6111"},
            {
                "pts": [
                    -0.30387430000000004,
                    6.240151,
                    -0.30387429999999993,
                    6.000151,
                    1.2219083,
                    6.000151,
                    1.2219083,
                    6.240151],
                "to": "Balcony-1549"}],
                  "hole_info": [], "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "e9007253-edf5-4c69-a58f-1adf27ed4e9a", "type": "sofa/single seat sofa", "style": "现代",
             "size": [0.9106700134277343, 0.9747419738769532, 1.0677400207519532], "scale": [1, 1, 1],
             "position": [-0.3471755364338055, -2.2327433991975907, -3.9761611382571393e-16], "rotation": [0, 0, 0],
             "entityId": "122848"},
            {"id": "f0c62145-e71d-4e79-bf84-45b983943823", "type": "table/dinning set", "style": "美式乡村",
             "size": [1.510140075683594, 2.34799887070465, 1.2599558501086427], "scale": [1, 1, 1],
             "position": [0.5807690637237799, 4.211316324118972, 0], "rotation": [0, 0, 0], "entityId": "122847"}],
                  "decorate_info": []},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_layout_test_01 = {
    "house_id": "01", "room_id": "LivingDiningRoom-515", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-515", "type": "LivingDiningRoom", "style": "european",
                  "area": 48.232351809823996, "height": 2.8,
                  "floor": [4.810874, -3.427427, -4.360302, -3.427427, -4.360302, 1.831697, 4.810874, 1.831697],
                  "door_info": [{"pts": [-4.360302, -0.041622748167247314, -4.600302, -0.041622748167247314, -4.600302,
                                         -1.6434727237531848, -4.360302, -1.6434727237531848], "to": ""}],
                  "hole_info": [], "window_info": [{"pts": [4.810874, 0.7370211506951089, 5.050874, 0.7370211506951089,
                                                            5.050874, -1.814728370722039, 4.810874, -1.814728370722039,
                                                            4.810874, 0.7370211506951089], "to": "", "height": 0.2}],
                  "baywindow_info": [], "furniture_info": [], "decorate_info": [
            {"id": "839cdb56-6020-48c4-9e34-b04e2ed40bb7", "type": "customized content/customized feature wall",
             "style": "", "size": [3.656109239139497, 5.259124000000002, 2.156749119421809], "scale": [1, 1, 1],
             "position": [-2.2192823362708025, -0.7978649999999994, 0], "rotation": [0, 0, 0], "entityId": "1288"}]},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "",
    "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_02 = {
    "house_id": "02", "room_id": "LivingDiningRoom-7469", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-7469", "type": "LivingDiningRoom", "style": "", "area": 23.231060529968,
                  "height": 2.6,
                  "floor": [3.148521, 0.637598, 3.088521, 0.637598, 3.088521, -2.988728, 0.024167, -2.988728, 0.024167,
                            -0.022312, -0.97672, -0.022312, -0.97672, 1.025981, -1.37146, 1.025981, -1.37146, 2.98047,
                            0.024167, 2.98047, 0.024167, 3.698808, 1.446606, 3.698808, 1.446606, 2.98047, 3.148521,
                            2.98047], "door_info": [{"pts": [-0.9767200000000001, 0.78626786, -1.0967200000000001,
                                                             0.78626786, -1.09672, -0.01375786000000001, -0.97672,
                                                             -0.01375786000000001], "to": "Bathroom-7426"}, {
                                                        "pts": [-0.93057118, -0.022312, -0.93057118, -0.262312,
                                                                -0.24981681999999994, -0.262312, -0.24981682,
                                                                -0.022312], "to": "MasterBedroom-7506"}, {
                                                        "pts": [0.6124911, -2.988728, 0.6124910999999997,
                                                                -3.2287280000000003, 2.4206469000000004,
                                                                -3.2287280000000003, 2.4206469000000004, -2.988728],
                                                        "to": "Balcony-7528"}, {
                                                        "pts": [3.148521, 1.2965809999999998, 3.2685210000000002,
                                                                1.2965809999999998, 3.2685210000000002, 2.542901,
                                                                3.148521, 2.542901], "to": "Kitchen-7547"}, {
                                                        "pts": [0.8991242095056152, 3.698808, 0.8991242095056152,
                                                                3.9388080000000003, 0.14068179049438478,
                                                                3.9388080000000003, 0.14068179049438478, 3.698808],
                                                        "to": ""}, {
                                                        "pts": [-1.3714600000000001, 1.89942886, -1.6114600000000001,
                                                                1.89942886, -1.61146, 1.0994031400000002, -1.37146,
                                                                1.0994031400000002], "to": "SecondBedroom-2850"}],
                  "hole_info": [], "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "306a850e-11ea-43e1-87e9-c33e32dd18e6", "type": "sofa/ multi seat sofa", "style": "现代",
             "size": [1.8443824765524293, 0.93068603515625, 0.8729479980468751], "scale": [0.655559, 1, 1],
             "position": [2.623657, -1.16307, 0], "rotation": [0, 0, 90], "entityId": "42341"},
            {"id": "a18b24ea-7024-45ca-a891-ff0f0c452be9", "type": "table/coffee table - rectangular", "style": "新中式",
             "size": [1.1842199707031251, 0.596427993774414, 0.5002000045776367], "scale": [1, 1, 1],
             "position": [1.436812, -1.16307, 0], "rotation": [0, 0, 90], "entityId": "42342"},
            {"id": "9ea8c214-7bf9-46cd-973f-e7662aeda87a", "type": "table/side table", "style": "新中式",
             "size": [0.5199432847854615, 0.5198375173274994, 0.549718017578125], "scale": [0.86594, 0.86581, 1],
             "position": [2.828087, 0.019093, 0], "rotation": [0, 0, 90], "entityId": "42343"},
            {"id": "9ea8c214-7bf9-46cd-973f-e7662aeda87a", "type": "table/side table", "style": "新中式",
             "size": [0.5199432847854615, 0.5198375173274994, 0.549718017578125], "scale": [0.86594, 0.86581, 1],
             "position": [2.828087, -2.345232, 0], "rotation": [0, 0, 90], "entityId": "42344"},
            {"id": "d9b857f3-b2a2-4f60-8065-5b30b753c73c", "type": "rug/rug", "style": "现代",
             "size": [3.3960681317190557, 2.3926619894874572, 0.009301339983940124], "scale": [0.998917, 0.996465, 1],
             "position": [2.656887, -0.83307, 0], "rotation": [0, 0, 90], "entityId": "42345"},
            {"id": "60ae9583-629f-476f-bb05-900200abf53d", "type": "electronics/TV - wall-attached", "style": "美式乡村",
             "size": [1.3051699829101562, 0.05678190231323242, 0.7361180114746094], "scale": [1, 1, 1],
             "position": [0.052391, -1.387621, 0.80008], "rotation": [0, 0, 270], "entityId": "42346"},
            {"id": "3a005c18-dee5-4324-aad0-0e7a0e841aba", "type": "media unit/floor-based media unit", "style": "新中式",
             "size": [2.0047900390625, 0.4764550018310547, 0.4988740158081055], "scale": [1, 1, 1],
             "position": [0.262227, -1.390461, 0], "rotation": [0, 0, 270], "entityId": "42347"},
            {"id": "6f4a5e15-651a-466f-834c-cdb087171b9a", "type": "table/dining table - round", "style": "新中式",
             "size": [1.3382899475097656, 1.3381300354003907, 0.7616619873046875], "scale": [1, 1, 1],
             "position": [1.903136, 2.230035, 0], "rotation": [0, 0, 270], "entityId": "42348"},
            {"id": "2dff2669-049b-4c03-8c2d-d8538e3f0df5", "type": "storage unit/dresser", "style": "新中式",
             "size": [0.8798770141601563, 0.391244010925293, 1.0798600006103516], "scale": [1, 1, 1],
             "position": [-0.6735, 2.784378, 0], "rotation": [0, 0, 360], "entityId": "42349"},
            {"id": "c81e7608-2c05-4665-b14b-e03221aabb3a", "type": "cabinet/hutch&buffet", "style": "新中式",
             "size": [0.7180000526280212, 0.3595989990234375, 0.9595429992675781], "scale": [0.718962, 1, 1],
             "position": [1.267201, 3.3395, 0], "rotation": [0, 0, 90], "entityId": "42350"},
            {"id": "1e411c30-e106-4157-ba34-d120b34e242e", "type": "lighting/floor lamp", "style": "现代",
             "size": [0.37861797810852055, 0.3422480010986328, 1.2269000244140624], "scale": [0.766154, 1, 1],
             "position": [2.897876, 0.267309, 0], "rotation": [0, 0, 90], "entityId": "42351"},
            {"id": "66c75755-6ce8-4f69-ac39-9768924519ce", "type": "lighting/pendant light", "style": "新中式",
             "size": [1.0534400177001952, 1.049530029296875, 0.7722170257568359], "scale": [1, 1, 1],
             "position": [1.748914, -1.163093, 1.827783], "rotation": [0, 0, 90], "entityId": "42352"},
            {"id": "cdb7779e-8f01-469e-a68e-af1e86c1dbd7", "type": "lighting/pendant light", "style": "新中式",
             "size": [0.2639963366508484, 0.13645700454711915, 1.106279983520508], "scale": [0.874664, 1, 1],
             "position": [1.912326, 2.230035, 1.49372], "rotation": [0, 0, 360], "entityId": "42353"},
            {"id": "827585d8-8f7e-4383-940a-f1814ffff6c5", "type": "curtain/curtain", "style": "现代",
             "size": [3.064001022154541, 0.23000014720939635, 2.599999011540527],
             "scale": [0.867721, 0.776081, 0.975474], "position": [1.556, -2.817, 0], "rotation": [0, 0, 180],
             "entityId": "42354"},
            {"id": "270a93f7-d616-43a3-a2f1-72d169bf39c4", "type": "accessory/accessory - on top of others",
             "style": "新中式", "size": [0.38714099884033204, 0.20147199630737306, 0.13958999633789063],
             "scale": [1, 1, 1], "position": [2.828087, -0.019029, 0.549718], "rotation": [0, 0, 90],
             "entityId": "42355"},
            {"id": "5a925601-3865-483c-957a-3eb97afe647d", "type": "plants/plants - on top of others", "style": "新中式",
             "size": [0.27308867986572266, 0.15554988273166656, 0.39504073067611695],
             "scale": [0.824446, 0.824446, 0.824446], "position": [-0.819371, 2.888214, 1.07986],
             "rotation": [0, 0, 180], "entityId": "42356"},
            {"id": "22f78a27-0695-4695-9dcd-4f286e338277", "type": "accessory/accessory - on top of others",
             "style": "新中式", "size": [0.09443712688170433, 0.10237279576921464, 0.3359562470550537],
             "scale": [0.909983, 0.98645, 0.98645], "position": [1.267201, 3.316498, 0.959543], "rotation": [0, 0, 90],
             "entityId": "42357"},
            {"id": "40c7a67d-b45d-4683-8e4f-1b2566d870e1", "type": "accessory/accessory - on top of others",
             "style": "新中式", "size": [0.1917798267331314, 0.07018759448456764, 0.2673624793624878],
             "scale": [0.909983, 0.98645, 0.98645], "position": [1.404365, 3.075084, 0.959543], "rotation": [0, 0, 90],
             "entityId": "42358"},
            {"id": "420dfef8-3fba-4c95-8e06-ac768887c081", "type": "art/art - wall-attached", "style": "新中式",
             "size": [0.9999567769035339, 0.0644604804387188, 0.7185256132933426],
             "scale": [1.190351, 1.190351, 1.190351], "position": [3.042021, -1.16307, 1.15], "rotation": [0, 0, 90],
             "entityId": "42359"},
            {"id": "3adc53fd-2912-4d0e-ba4f-d21688decfa7", "type": "accessory/accessory - wall-attached",
             "style": "简欧/新古典", "size": [0.6187139892578125, 0.06009439945220947, 0.23817800521850585],
             "scale": [1, 1, 1], "position": [1.915342, 2.929953, 1.8], "rotation": [0, 0, 360], "entityId": "42360"}],
                  "decorate_info": [{"id": "e2ed01bd-3930-4486-a088-3c3e086cb01b",
                                     "type": "customized content/smart customized ceiling",
                                     "size": [4.519781, 6.687336, 0.15], "scale": [1, 1, 1],
                                     "position": [0.888531, 0.35504, 2.45], "rotation": [0, 0, 0], "entityId": "13655"},
                                    {"id": "dab0f519-f8a1-4f64-8127-d892266f8dc4",
                                     "type": "customized content/customized feature wall",
                                     "size": [0.558982636095, 0.01, 2.4000004], "scale": [0.199257, 1, 0.979592],
                                     "position": [3.142521, 0.91709, 0], "rotation": [0, 0, -270],
                                     "entityId": "13675"}]}, "layout_number": 2, "propose_number": 3,
    "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_03 = {
    "house_id": "03", "room_id": "LivingRoom-9744", "house_data": {},
    "room_data": {"id": "LivingRoom-9744", "type": "LivingRoom", "style": "", "area": 18.370350784254, "height": 2.6,
                  "floor": [2.168954, -4.154341, -2.221873, -4.154341, -2.221873, 0.029461, 2.168954, 0.029461],
                  "door_info": [{"pts": [2.0288492999999996, -4.274341000000001, 2.0288493, -4.1543410000000005,
                                         -2.0134232999999995, -4.154341, -2.0134233, -4.274341], "to": "Balcony-9760"}],
                  "hole_info": [{"pts": [-0.512107, 0.149461, -0.512107, 0.029460999999999987, 0.48789299999999997,
                                         0.029460999999999987, 0.487893, 0.149461], "to": "Corridor-9722"}],
                  "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "ffd8bf9e-dcc8-4581-b074-ecb839acb8b4", "type": "media unit/floor-based media unit", "style": "美式乡村",
             "size": [2.392929992675781, 0.4485760116577149, 0.4872769927978516], "scale": [1, 1, 1],
             "position": [-1.9975849941711425, -2.0149638623451662, 6.3692380677398726e-18], "rotation": [0, 0, -90],
             "entityId": "15815"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_04 = {
    "house_id": "04", "room_id": "LivingDiningRoom-7166", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-7166", "type": "LivingDiningRoom", "style": "modern",
                  "area": 25.612676477395496, "height": 2.6,
                  "floor": [0.339656, 2.006878, 0.335155, -0.4821, 0.327606, -4.656709, 0.267606, -4.656654, 0.267606,
                            -5.127853, -3.260588, -5.127853, -3.260588, 2.006878], "door_info": [{"pts": [-2.3209588,
                                                                                                          -5.127853,
                                                                                                          -2.3209588,
                                                                                                          -5.367853,
                                                                                                          -0.40912119999999996,
                                                                                                          -5.367853,
                                                                                                          -0.40912119999999996,
                                                                                                          -5.127853],
                                                                                                  "to": "Balcony-7312"},
                                                                                                 {"pts": [
                                                                                                     0.45478725180577834,
                                                                                                     -0.6854214193786885,
                                                                                                     0.33478744800660426,
                                                                                                     -0.6852044213147892,
                                                                                                     0.3333407481942217,
                                                                                                     -1.4852285806213117,
                                                                                                     0.4533405519933958,
                                                                                                     -1.485445578685211],
                                                                                                     "to": "Bedroom-7182"},
                                                                                                 {"pts": [
                                                                                                     0.4570102518057783,
                                                                                                     0.5434555806213116,
                                                                                                     0.33701044800660424,
                                                                                                     0.5436725786852109,
                                                                                                     0.3355637481942217,
                                                                                                     -0.2563515806213116,
                                                                                                     0.45556355199339577,
                                                                                                     -0.2565685786852109],
                                                                                                     "to": "Library-2163"}],
                  "hole_info": [
                      {"pts": [-0.760143, 2.126878, -0.760143, 2.006878, 0.239857, 2.006878, 0.239857, 2.126878],
                       "to": "Corridor-7239"},
                      {"pts": [-1.806229, 2.006878, -1.806229, 2.126878, -2.806229, 2.126878, -2.806229, 2.006878],
                       "to": "Kitchen-7277"}, {
                          "pts": [-3.260588, 2.0046109999999997, -3.500588, 2.0046109999999997, -3.500588,
                                  1.0046110000000001, -3.260588, 1.004611], "to": "Corridor-7296"}], "window_info": [],
                  "baywindow_info": [], "furniture_info": [], "decorate_info": []}, "layout_number": 2,
    "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "",
    "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_05 = {
    "house_id": "05", "room_id": "LivingDiningRoom-5394", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-5394", "type": "LivingDiningRoom", "style": "Nordic",
                  "area": 41.206164713370995, "height": 2.6,
                  "floor": [-3.898569, 6.513138, -3.898569, 0.875763, -3.15717, 0.875763, -3.15717, -3.86545, -7.403169,
                            -3.86545, -7.403169, 1.636214, -8.715493, 1.636214, -8.715493, 3.964202, -6.721771,
                            3.964202, -6.721771, 6.513138], "door_info": [{"pts": [-7.275227266323165, 3.964202,
                                                                                   -7.275227266323165,
                                                                                   4.084201999999999,
                                                                                   -8.075252733676834,
                                                                                   4.084201999999999,
                                                                                   -8.075252733676834, 3.964202],
                                                                           "to": "Bedroom-5360"}, {
                                                                              "pts": [-8.715493, 3.0137027336768343,
                                                                                      -8.835493000000001,
                                                                                      3.0137027336768343,
                                                                                      -8.835493000000001,
                                                                                      2.213677266323166, -8.715493,
                                                                                      2.213677266323166],
                                                                              "to": "Bathroom-5416"}, {
                                                                              "pts": [-7.675399266323166, 1.516214,
                                                                                      -7.675399266323167, 1.636214,
                                                                                      -8.475424733676835, 1.636214,
                                                                                      -8.475424733676833, 1.516214],
                                                                              "to": "Bedroom-5466"}, {
                                                                              "pts": [-3.8483775000000002, -3.98545,
                                                                                      -3.8483775, -3.86545,
                                                                                      -6.342430500000001, -3.86545,
                                                                                      -6.342430500000001, -3.98545],
                                                                              "to": "Balcony-5438"}, {
                                                                              "pts": [-3.1571700000000003,
                                                                                      -0.08731273367683412, -3.03717,
                                                                                      -0.08731273367683412, -3.03717,
                                                                                      0.7127127336768341,
                                                                                      -3.1571700000000003,
                                                                                      0.7127127336768341],
                                                                              "to": "Bedroom-5482"}, {
                                                                              "pts": [-3.898569, 2.1150595258436584,
                                                                                      -3.658569, 2.1150595258436584,
                                                                                      -3.658569, 2.8369764741563412,
                                                                                      -3.898569, 2.8369764741563412],
                                                                              "to": ""}, {
                                                                              "pts": [-5.931965, 6.633138, -5.931965,
                                                                                      6.5131380000000005,
                                                                                      -4.395664999999999,
                                                                                      6.5131380000000005,
                                                                                      -4.395664999999999, 6.633138],
                                                                              "to": "Kitchen-1443"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [], "furniture_info": [], "decorate_info": [
            {"id": "93d97355-121b-43e1-99f8-10cc7a65d9e9", "type": "customized content/customized feature wall",
             "style": "", "size": [0.16927, 4.947479, 2.6], "scale": [1, 1, 1], "position": [-7.318534, -1.39171, 0],
             "rotation": [0, 0, 0], "entityId": "13177"}]}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_06 = {
    "house_id": "06", "room_id": "LivingDiningRoom-4933", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-4933", "type": "LivingDiningRoom", "style": "", "area": 33.121335035179996,
                  "height": 2.6,
                  "floor": [1.391915, 0.185644, 1.391915, -4.924075, -2.021856, -4.924075, -2.021856, 0.331689,
                            -2.297592, 0.331689, -2.297592, 4.225195, 0.217417, 4.225195, 0.217417, 2.477202, 2.643141,
                            2.477202, 2.643141, 0.185644], "door_info": [
            {"pts": [-1.507683, -4.924075, -1.507683, -5.164075, 0.9723930000000001, -5.164075, 0.972393, -4.924075],
             "to": "Balcony-5044"}, {
                "pts": [1.6832792, 0.18564399999999998, 1.6832792000000003, -0.05435599999999999, 2.4833048,
                        -0.05435599999999999, 2.4833048, 0.18564399999999998], "to": "MasterBedroom-5028"}, {
                "pts": [2.643141, 0.21945519999999996, 2.883141, 0.21945519999999985, 2.883141, 1.0194808000000002,
                        2.643141, 1.0194808000000002], "to": "Bathroom-5009"}, {
                "pts": [1.3198067336768342, 2.4772019999999997, 1.3198067336768342, 2.717202, 0.5197812663231658,
                        2.717202, 0.5197812663231659, 2.4772019999999997], "to": "KidsRoom-4958"}, {
                "pts": [-0.766142, 4.225195, -0.7661419999999999, 4.4651950000000005, -2.302442, 4.4651950000000005,
                        -2.302442, 4.225195], "to": "Kitchen-4974"}, {
                "pts": [-2.297592, 1.4417214959106446, -2.537592, 1.4417214959106446, -2.537592, 0.5417205040893553,
                        -2.297592, 0.5417205040893553], "to": ""}, {
                "pts": [-2.2618560000000003, -0.9102139537366105, -2.021856, -0.9102139537366105, -2.021856,
                        0.003989953736610485, -2.2618560000000003, 0.00398995373661043], "to": "Library-1440"}],
                  "hole_info": [], "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "fd304f03-a83e-4782-bded-ff5ee0431b49", "type": "sofa/single seat sofa", "style": "现代",
             "size": [2.2233099365234374, 1.0066799926757812, 0.7563670349121094], "scale": [1, 1, 1],
             "position": [0.8885750036621088, -2.483331058236627, -2.6644598410903136e-16], "rotation": [0, 0, 90],
             "entityId": "57849"}], "decorate_info": [
            {"id": "2fc04233-cdce-4cab-be80-612f3d46183f", "type": "customized content/smart customized ceiling",
             "size": [4.940533, 9.14907, 0.15], "scale": [1, 1, 1], "position": [0.172775, -0.34944, 2.45],
             "rotation": [0, 0, 0], "entityId": "11310"}]},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_07 = {
    "house_id": "07", "room_id": "LivingRoom-4863", "house_data": {},
    "room_data": {"id": "LivingRoom-4863", "type": "LivingRoom", "style": "", "area": 50.879231188331, "height": 2.8,
                  "floor": [1.134699, -2.689704, -0.831283, -2.689704, -0.831283, -0.034817, -5.701786, -0.034817,
                            -5.701786, 5.038065, -1.877384, 5.038065, -1.877384, 5.098065, -0.891283, 5.098065,
                            -0.891283, 5.218065, -1.757384, 5.218065, -1.757384, 7.52228, 0.527868, 7.52228, 0.527868,
                            5.098065, 1.608786, 5.098065, 1.608786, 2.632813, 3.331352, 2.632813, 3.331352, 0.723722,
                            1.134699, 0.723722], "door_info": [{"pts": [1.254699, -1.8158404679355002, 1.134699,
                                                                        -1.8158404679355002, 1.134699, -2.6312695320645,
                                                                        1.254699, -2.6312695320645],
                                                                "to": "Bedroom-7802"}, {
                                                                   "pts": [3.331352, 1.422260482835, 3.571352,
                                                                           1.422260482835, 3.571352, 2.180799517165,
                                                                           3.331352, 2.180799517165], "to": ""}, {
                                                                   "pts": [2.446288367661, 2.752813, 2.446288367661,
                                                                           2.632813, 3.1858636323389997, 2.632813,
                                                                           3.1858636323389997, 2.752813],
                                                                   "to": "Bathroom-8989"}, {
                                                                   "pts": [0.79646542245, 5.218064999999999,
                                                                           0.7964654224499998, 5.098065, 1.47915057755,
                                                                           5.098065, 1.47915057755, 5.218064999999999],
                                                                   "to": "Kitchen-3752"}, {
                                                                   "pts": [-0.8312830000000001, -1.8204937780625,
                                                                           -0.9512830000000001, -1.8204937780625001,
                                                                           -0.951283, -2.6738502219375, -0.831283,
                                                                           -2.6738502219374998], "to": "Bedroom-6301"},
                                                               {"pts": [-0.6447581464000001, -2.689704, -0.6447581464,
                                                                        -2.809704, 1.0619541464000002, -2.809704,
                                                                        1.0619541464, -2.689704],
                                                                "to": "Bedroom-7023"}], "hole_info": [],
                  "window_info": [{"pts": [0.20859762560000006, 7.52228, 0.20859762560000017, 7.7622800000000005,
                                           -1.1757356256000002, 7.7622800000000005, -1.1757356256000002, 7.52228],
                                   "to": "", "height": 0.9}, {
                                      "pts": [-1.757384, 7.0923395384, -1.997384, 7.0923395384, -1.9973839999999998,
                                              5.5373344615999995, -1.7573839999999998, 5.5373344615999995], "to": "",
                                      "height": 0.9}, {
                                      "pts": [-2.882447892815, 5.038065, -2.8824478928149997, 5.278065, -5.556298107185,
                                              5.278065, -5.556298107185, 5.038065], "to": "", "height": 0.2}],
                  "baywindow_info": [], "furniture_info": [
            {"id": "ff10f338-d777-46aa-8deb-2fd761819522", "type": "sofa/type L sofa", "style": "现代",
             "size": [4.143049926757812, 2.2541099548339845, 1.0256600189208984], "scale": [1, 1, 1],
             "position": [-2.6883394495305484, 2.5549277007042264, 2.31141358985762e-17], "rotation": [0, 0, -90],
             "entityId": "13642"}], "decorate_info": []},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_08 = {
    "house_id": "08", "room_id": "LivingRoom-3909", "house_data": {},
    "room_data": {"id": "LivingRoom-3909", "type": "LivingRoom", "style": "US", "area": 34.456820187552005,
                  "height": 2.8,
                  "floor": [-0.663536, -1.5872, -1.802721, -1.5872, -1.802721, -0.089211, -0.723536, -0.089211,
                            -0.723536, -0.029211, -0.459979, -0.029211, -0.459979, -0.602034, -0.339979, -0.602034,
                            -0.339979, 0.090789, -0.603536, 0.090789, -0.603536, 3.434527, 1.017607, 3.434527, 1.017607,
                            2.503746, 1.137607, 2.503746, 1.137607, 5.591319, 2.820328, 5.591319, 2.820328, 2.8973,
                            3.956358, 2.8973, 3.956358, -0.765961, 3.836358, -0.765961, 3.836358, -3.743992, 2.247581,
                            -3.743992, 2.247581, -3.803992, 2.153637, -3.803992, 2.153637, -2.972695, 0.614198,
                            -2.972695, 0.614198, -2.587835, -0.663536, -2.587835], "door_info": [{"pts": [1.137607,
                                                                                                          5.1417266672,
                                                                                                          1.017607,
                                                                                                          5.1417266672,
                                                                                                          1.017607,
                                                                                                          3.7100473328000003,
                                                                                                          1.137607,
                                                                                                          3.7100473328000003],
                                                                                                  "to": "Kitchen-5511"},
                                                                                                 {"pts": [-0.603536,
                                                                                                          3.2020334264400003,
                                                                                                          -0.843536,
                                                                                                          3.2020334264400003,
                                                                                                          -0.843536,
                                                                                                          2.46310257356,
                                                                                                          -0.603536,
                                                                                                          2.46310257356],
                                                                                                  "to": ""}, {
                                                                                                     "pts": [-1.802721,
                                                                                                             -0.5695934887999998,
                                                                                                             -1.9227210000000001,
                                                                                                             -0.5695934887999998,
                                                                                                             -1.9227210000000001,
                                                                                                             -1.5240445112,
                                                                                                             -1.802721,
                                                                                                             -1.5240445112],
                                                                                                     "to": "Bathroom-4660"},
                                                                                                 {"pts": [
                                                                                                     -1.6933827960185002,
                                                                                                     -1.5872,
                                                                                                     -1.6933827960185002,
                                                                                                     -1.7072,
                                                                                                     -0.9236632039815,
                                                                                                     -1.7072,
                                                                                                     -0.9236632039815,
                                                                                                     -1.5872],
                                                                                                     "to": "Bedroom-4374"},
                                                                                                 {"pts": [
                                                                                                     -0.446436924736,
                                                                                                     -2.587835,
                                                                                                     -0.44643692473600005,
                                                                                                     -2.707835,
                                                                                                     0.338676924736,
                                                                                                     -2.707835,
                                                                                                     0.33867692473600003,
                                                                                                     -2.587835],
                                                                                                     "to": "Bedroom-4971"}],
                  "hole_info": [], "window_info": [{"pts": [2.4631025641999997, -3.743992, 2.4631025641999997,
                                                            -3.983992, 3.7562314358, -3.983992, 3.7562314358,
                                                            -3.743992], "to": "", "height": 0.9}, {
                                                       "pts": [3.817808749272, 2.8973, 3.817808749272, 3.1373,
                                                               3.202033250728, 3.1373, 3.202033250728, 2.8973],
                                                       "to": "", "height": 0.9}, {
                                                       "pts": [2.7248065311999996, 5.5913189999999995,
                                                               2.7248065311999996, 5.831319, 1.3393114688, 5.831319,
                                                               1.3393114687999998, 5.5913189999999995], "to": "",
                                                       "height": 0.9}], "baywindow_info": [], "furniture_info": [],
                  "decorate_info": [
                      {"id": "1868d2fa-f839-4bc3-84cc-706afbdf887e", "type": "build element/column - DIY - square",
                       "style": "其他", "size": [0.4, 0.56912, 2.8], "scale": [1, 1, 1],
                       "position": [1.22659, 2.851381, 0], "rotation": [0, 0, 0], "entityId": "6851"}]},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_09 = {
    "house_id": "09", "room_id": "LivingDiningRoom-6309", "house_data": {},
    "room_data": {"id": "LivingDiningRoom-6309", "type": "LivingDiningRoom", "style": "", "area": 17.793162863609,
                  "height": 2.8,
                  "floor": [2.414662, 3.368691, 2.428088, 0.011675, 3.6285, 0.011675, 3.6285, -1.610866, -0.758537,
                            -1.610866, -0.758537, 3.368691], "door_info": [{"pts": [-0.998537, 0.8798012736958672,
                                                                                    -0.758537, 0.8798012736958674,
                                                                                    -0.758537, 2.369801273695867,
                                                                                    -0.998537, 2.369801273695867],
                                                                            "to": "Bedroom-516"}, {
                                                                               "pts": [-0.758537, -0.3417108421567311,
                                                                                       -0.998537, -0.341710842156731,
                                                                                       -0.998537, -1.2559148421567312,
                                                                                       -0.758537, -1.2559148421567312],
                                                                               "to": "Bedroom-2471"}, {
                                                                               "pts": [3.6284997603389724,
                                                                                       -1.123787537491014,
                                                                                       3.8684997603389726,
                                                                                       -1.123787537491014,
                                                                                       3.8684997603389726,
                                                                                       -0.209583537491014,
                                                                                       3.6284997603389724,
                                                                                       -0.209583537491014], "to": ""}, {
                                                                               "pts": [2.426094216013033,
                                                                                       0.5102610543837915,
                                                                                       2.6660922966310974,
                                                                                       0.5112208979362052,
                                                                                       2.656257916411435,
                                                                                       2.970197020505154,
                                                                                       2.4162598357933707,
                                                                                       2.9692371769527406],
                                                                               "to": "undefined-7870"}],
                  "hole_info": [], "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "6cfdeac3-c9ed-49a7-addc-2fcad1e3147e", "type": "sofa/ multi seat sofa", "style": "北欧",
             "size": [2.13096, 1.1171, 0.9011990000000001], "scale": [1, 1, 1],
             "position": [0.7356178294783209, 2.8104500000000003, 0], "rotation": [0, 0, 360], "entityId": "11964"},
            {"id": "8f3688a0-9a98-426c-8476-03de07db74e6", "type": "sofa/single seat sofa", "style": "北欧",
             "size": [0.774921, 0.798038, 0.8875069999999999], "scale": [1, 1, 1],
             "position": [-0.3578681677750971, 1.4547630126953126, 0], "rotation": [0, 0, 289.14673519321275],
             "entityId": "11965"},
            {"id": "6f7c8ce9-cbf6-4058-83e8-98af0a8ec735", "type": "table/coffee table - rectangular", "style": "现代",
             "size": [1.2, 0.714382, 0.42], "scale": [1, 1, 1], "position": [0.687697829478321, 1.5668490000000004, 0],
             "rotation": [0, 0, 360], "entityId": "11967"},
            {"id": "1bd9d3c3-ddf8-4dfb-82be-9bde11a34df8", "type": "cabinet/floor-based cabinet", "style": "现代",
             "size": [1.804, 0.46399999999999997, 0.455981], "scale": [1, 1, 1],
             "position": [0.6471264840844627, -1.3790000000000002, 0], "rotation": [0, 0, 180], "entityId": "11968"},
            {"id": "00b8557e-db77-4458-84df-4b22563949cc", "type": "rug/rug", "style": "北欧",
             "size": [2.942818, 2.402310028076172, 0.009301609992980957],
             "scale": [0.9809393333333333, 1.201155014038086, 0.8149013520623911],
             "position": [0.7130168197126958, 2.1675874832153323, 0], "rotation": [0, 0, 360], "entityId": "11991"},
            {"id": "e5e6d90f-58c5-4293-8dc0-0a701af93bd5", "type": "electronics/TV - wall-attached", "style": "现代",
             "size": [1.55652, 0.095835, 0.891706], "scale": [1, 1, 1],
             "position": [0.6534164840844626, -1.563082500457764, 0.7306], "rotation": [0, 0, 180],
             "entityId": "11992"},
            {"id": "ee908502-9682-4141-8df4-fcd6902f64ab", "type": "cabinet/floor-based cabinet", "style": "北欧",
             "size": [0.85, 0.4, 0.9], "scale": [1, 1, 1], "position": [-0.559, 0.269, 0], "rotation": [0, 0, 270],
             "entityId": "11993"},
            {"id": "9303c46f-a76b-46ab-9df0-27da2912f408", "type": "art/art - wall-attached", "style": "北欧",
             "size": [0.4502099990844726, 0.02641502120628357, 0.6002799987792969],
             "scale": [0.7503499984741211, 0.7503499984741211, 0.7503499984741211],
             "position": [0.7356178294783209, 3.3514998998641974, 1.001199], "rotation": [0, 0, 360],
             "entityId": "11994"},
            {"id": "9f4382b4-13d7-4d88-8c46-e4c236f9195c", "type": "accessory/accessory - wall-attached", "style": "现代",
             "size": [0.22527264705882352, 0.0628519, 0.9], "scale": [0.5294117647058824, 1, 0.5294117647058824],
             "position": [-0.7275740494728089, 0.269, 0.8999999999999999], "rotation": [0, 0, 270],
             "entityId": "11995"},
            {"id": "9303c46f-a76b-46ab-9df0-27da2912f408", "type": "art/art - wall-attached", "style": "北欧",
             "size": [0.4502099990844726, 0.02641502120628357, 0.6002799987792969],
             "scale": [0.7503499984741211, 0.7503499984741211, 0.7503499984741211],
             "position": [0.7251078294783211, 3.3514998998641974, 1.7554400000000001], "rotation": [0, 0, 360],
             "entityId": "11996"},
            {"id": "7be78e99-5ace-466f-84bf-e4509dabebb3", "type": "lighting/pendant light", "style": "北欧",
             "size": [0.823686, 0.8236870000000001, 0.822617], "scale": [1, 1, 1],
             "position": [0.5925517680965559, 0.9431625167846679, 1.9773830000000001], "rotation": [0, 0, 360],
             "entityId": "11997"},
            {"id": "6da22cc6-2c4f-4b09-bd6f-05a1c69810d4", "type": "300 - on top of others", "style": "新中式",
             "size": [0.653178, 0.21159, 0.513904], "scale": [1, 1, 1],
             "position": [0.665437829478321, 1.8335590000000002, 0.42], "rotation": [0, 0, 269.99947836776414],
             "entityId": "11998"},
            {"id": "0346aa62-81e0-48c6-87b6-f9b6c26e50f8", "type": "accessory/accessory - on top of others",
             "style": "现代", "size": [0.6651690000000001, 0.314236, 0.459007], "scale": [1, 1, 1],
             "position": [0.6471264840844627, -1.3184742197587316, 0.455981], "rotation": [0, 0, 180],
             "entityId": "11999"},
            {"id": "0346aa62-81e0-48c6-87b6-f9b6c26e50f8", "type": "accessory/accessory - on top of others",
             "style": "现代", "size": [0.5989780403317001, 0.28296637919336604, 0.4133312186204297],
             "scale": [0.9004900113079533, 0.9004900113079533, 0.9004900113079533],
             "position": [-0.5771000000000002, 0.18176526573690177, 0.9], "rotation": [0, 0, 270], "entityId": "12000"},
            {"id": "169850a1-16bc-49ac-90eb-39078cb8d2b5", "type": "accessory/accessory - on top of others",
             "style": "其他", "size": [0.46099998832, 0.049065000000000004, 0.47899887455000006],
             "scale": [1.76776, 1, 1.71935], "position": [-0.6013300000000007, 0.26276, 0.9], "rotation": [0, 0, 90],
             "entityId": "12001"}], "decorate_info": []},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_09_v2 = {
    "house_id": "09_v2", "room_id": "LivingDiningRoom-3982", "house_data": {},
    "room_data": {
        "id":"LivingDiningRoom-3982","type":"LivingDiningRoom","style":"modern","area":33.70105624666585,"height":2.8,"floor":[1.480176999999999,-2.728403,1.4801769999999985,5.037520800723448,2.4964872667494533,5.398640459699019,3.568071530606555,5.521119567520774,4.639655794463657,5.39864045969902,5.655966061213111,5.037520800723447,5.655966061213111,-2.7284029999999997],"door_info":[{"pts":[1.4801769999999999,-0.43284116625477964,1.2401769999999999,-0.43284116625477953,1.240177,-1.9228411662547797,1.480177,-1.9228411662547797],"to":""},{"pts":[3.4049184597075515,-2.7284029999999992,3.4049184597075515,-2.9684029999999995,4.319122459707551,-2.9684029999999995,4.319122459707551,-2.7284029999999992],"to":""}],"hole_info":[],"window_info":[{"pts":[5.895966061213112,1.819270301566509,5.895966061213112,3.98079430156651,5.655966061213112,3.98079430156651,5.655966061213112,1.8192703015665093],"to":"","height":0.2,"indent":0.12}],"baywindow_info":[],"furniture_info":[],"decorate_info":[]
    },
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
# 布局算法接口 测试输入:单屋设计 卧室 书房 儿童房
smart_decoration_input_layout_test_10 = {
    "house_id": "10", "room_id": "MasterBedroom-7506", "house_data": {},
    "room_data": {"id": "MasterBedroom-7506", "type": "MasterBedroom", "style": "", "area": 9.828568303359,
                  "height": 2.6,
                  "floor": [-0.215833, -0.262312, -0.215833, -4.045003, -0.913647, -4.045003, -0.913647, -4.681245,
                            -2.274513, -4.681245, -2.274513, -4.106575, -2.951803, -4.106575, -2.951803, -0.985473,
                            -0.97672, -0.985473, -0.97672, -0.262312], "door_info": [{"pts": [-0.93057118, -0.022312,
                                                                                              -0.93057118, -0.262312,
                                                                                              -0.24981681999999994,
                                                                                              -0.262312, -0.24981682,
                                                                                              -0.022312],
                                                                                      "to": "LivingDiningRoom-7469"}],
                  "hole_info": [], "window_info": [{"pts": [-2.274513, -4.2817027448675535, -2.514513,
                                                            -4.2817027448675535, -2.514513, -4.868087255132446,
                                                            -2.274513, -4.868087255132446], "to": "", "height": 0.85}, {
                                                       "pts": [-2.297342790161133, -4.681245, -2.297342790161133,
                                                               -4.921245, -0.9475772098388671, -4.921245,
                                                               -0.9475772098388672, -4.681245], "to": "",
                                                       "height": 0.85}, {
                                                       "pts": [-0.913647, -4.926809640072327, -0.673647,
                                                               -4.926809640072327, -0.673647, -4.281702359927674,
                                                               -0.913647, -4.281702359927674], "to": "",
                                                       "height": 0.85}], "baywindow_info": [], "furniture_info": [
            {"id": "6070e88e-8c00-48f6-bf25-8905607a81c5", "type": "bed/king-size bed", "style": "新中式",
             "size": [1.7513499450683594, 2.168690032958984, 1.0199500274658204], "scale": [1, 1, 1],
             "position": [-1.867655, -2.45709, 0], "rotation": [0, 0, 270], "entityId": "42391"},
            {"id": "2b8457a3-f952-4229-9c9d-412a60a49d58", "type": "rug/rug", "style": "新中式",
             "size": [2.8993889999999998, 2.00008, 0.009301404369604587], "scale": [0.966463, 1.00004, 0.775117],
             "position": [-1.559142, -2.528475, 0], "rotation": [0, 0, 90], "entityId": "42392"},
            {"id": "fd2cea3c-4c33-46d2-94a6-bfae1cda9399", "type": "table/night table", "style": "新中式",
             "size": [0.5970000076293945, 0.4, 0.46], "scale": [1, 1, 1], "position": [-2.704877, -1.282915, 0],
             "rotation": [0, 0, 270], "entityId": "42393"},
            {"id": "fd2cea3c-4c33-46d2-94a6-bfae1cda9399", "type": "table/night table", "style": "新中式",
             "size": [0.5970000076293945, 0.4, 0.46], "scale": [1, 1, 1], "position": [-2.752, -3.631265, 0],
             "rotation": [0, 0, 270], "entityId": "42394"},
            {"id": "6f8c1ba5-0ac8-4b8d-b052-93ace231da0c", "type": "plants/plants - on top of others", "style": "其他",
             "size": [0.30000048507, 0.30069854855999995, 0.418039], "scale": [0.44741, 0.44964, 1],
             "position": [-1.164, -4.510999, 0], "rotation": [0, 0, 180], "entityId": "42395"},
            {"id": "9aa1118f-8d60-449c-91f2-7eb5c9ac3542", "type": "lighting/pendant light", "style": "新中式",
             "size": [0.7185795752755737, 0.74608371529953, 0.7800003951088714],
             "scale": [0.879879, 0.879879, 0.879879], "position": [-1.631917, -2.457072, 1.82], "rotation": [0, 0, 270],
             "entityId": "42396"},
            {"id": "1048eba9-feb6-498a-bfaf-516a6831950b", "type": "curtain/curtain", "style": "新中式",
             "size": [1.3610000471484376, 0.23000000734329223, 1.8999991042396545],
             "scale": [0.607264, 1.024435, 0.919055], "position": [-1.595, -4.566, 0.7], "rotation": [0, 0, 180],
             "entityId": "42397"},
            {"id": "d839ab86-33a2-4902-9b5f-b71c22f03063", "type": "accessory/accessory - on top of others",
             "style": "现代", "size": [0.20092705228302957, 0.4405847745117759, 0.09760360463523388],
             "scale": [1.624677, 1.624677, 1.624677], "position": [-2.660131, -1.312938, 0.46], "rotation": [0, 0, 360],
             "entityId": "42398"},
            {"id": "e5e6d90f-58c5-4293-8dc0-0a701af93bd5", "type": "electronics/TV - wall-attached", "style": "现代",
             "size": [1.5999935295669556, 0.09583499908447266, 1.00000370369339], "scale": [1.02793, 1, 1.12145],
             "position": [-0.263917, -2.725, 0.76199], "rotation": [0, 0, 90], "entityId": "42399"},
            {"id": "622c4644-514a-4f3e-8d3c-1c003689844c", "type": "art/art - wall-attached", "style": "新中式",
             "size": [0.5100160999328613, 0.014544433032245637, 0.5100001815618896],
             "scale": [0.530904, 0.530904, 0.530904], "position": [-2.921999, -2.45709, 1.28383],
             "rotation": [0, 0, 270], "entityId": "42400"}], "decorate_info": [
            {"id": "ff8e213e-c3c5-49c1-87b0-199cac0b6471", "type": "customized content/smart customized ceiling",
             "size": [2.73577, 3.695572, 0.15], "scale": [1, 1, 1], "position": [-1.583818, -2.833359, 2.45],
             "rotation": [0, 0, 0], "entityId": "13705"}]}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_11 = {
    "house_id": "11", "room_id": "undefined-4281", "house_data": {},
    "room_data": {"id": "undefined-4281", "type": "", "style": "", "area": 10.064373445545, "height": 2.8,
                  "floor": [-4.513637, 1.019167, -1.613232, 1.019167, -1.613232, -2.450822, -4.513637, -2.450822],
                  "door_info": [{"pts": [-2.740157632, 1.259166656, -2.740157632, 1.019166656, -2.00123872, 1.019166656,
                                         -2.00123872, 1.259166656], "to": "undefined-5177"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [{"pts": [-2.6170044800000003, -2.570822048, -4.1872071680000005,
                                                                 -2.570822048, -4.1872071680000005, -2.8108220480000004,
                                                                 -4.241207168000001, -2.8108220480000004,
                                                                 -4.241207168000001, -3.4248220480000002, -2.56300448,
                                                                 -3.4248220480000002, -2.56300448, -2.8108220480000004,
                                                                 -2.6170044800000003, -2.8108220480000004,
                                                                 -2.6170044800000003, -2.570822048], "to": "",
                                                         "height": 0.5}], "furniture_info": [
            {"id": "af7faa9b-97b6-476c-9e7d-d3468e7b0cf7", "type": "shelf/book shelf", "style": "新中式",
             "size": [1.43, 0.35000000000000003, 1.6480000305175782], "scale": [1, 1, 1],
             "position": [-4.3386373439999995, -1.1639533424927004, -5.918831684149906e-17], "rotation": [0, 0, -90],
             "entityId": "7991"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_12 = {
    "house_id": "12", "room_id": "KidsRoom-12702", "house_data": {},
    "room_data": {"id": "KidsRoom-12702", "type": "KidsRoom", "style": "", "area": 14.510457950563005, "height": 2.6,
                  "floor": [-3.283805, 2.638969, -3.283805, 2.931363, -4.942664, 2.955685, -4.942664, 7.134597,
                            -1.602603, 7.134597, -1.602603, 2.638969], "door_info": [{"pts": [-1.8569027793124009,
                                                                                              2.3989689999999997,
                                                                                              -1.8569027793124007,
                                                                                              2.638969,
                                                                                              -2.565023220687599,
                                                                                              2.638969,
                                                                                              -2.5650232206875994,
                                                                                              2.3989689999999997],
                                                                                      "to": "Corridor-12674"}],
                  "hole_info": [], "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "9556a5c9-6d6a-4500-851f-571a5a0494aa", "type": "table/table", "style": "地中海",
             "size": [1.3266099548339845, 0.5735150146484375, 1.8659800720214843], "scale": [1, 1, 1],
             "position": [-4.279359022583009, 5.235992250302658, 3.8104839296100674e-17], "rotation": [0, 0, 0],
             "entityId": "22995"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_13 = {
    "house_id": "13", "room_id": "undefined-7082", "house_data": {},
    "room_data": {"id": "undefined-7082", "type": "", "style": "", "area": 18.62403865910401, "height": 2.8,
                  "floor": [-1.447246, -1.542553, -1.447246, -6.953897, -4.888912, -6.953897, -4.888912, -1.542553],
                  "door_info": [{"pts": [-1.3272463115, -2.393264629000001, -1.4472463115, -2.393264629000001,
                                         -1.4472463115, -3.2404379490000004, -1.3272463115, -3.2404379490000004],
                                 "to": "LivingRoom-7696"}, {
                                    "pts": [-3.8440489395000004, -1.42255331, -3.8440489395000004, -1.5425533100000002,
                                            -2.4885716275000007, -1.5425533100000002, -2.4885716275000007, -1.42255331],
                                    "to": "undefined-8571"}], "hole_info": [], "window_info": [{"pts": [
            -4.3523529315000005, -6.953897222, -4.3523529315000005, -7.193897222, -2.0861643005, -7.193897222,
            -2.0861643005, -6.953897222], "to": "", "height": 0.9}], "baywindow_info": [], "furniture_info": [
            {"id": "4297c775-421f-4a15-ab59-2b5b3adbffdc", "type": "table/table", "style": "现代",
             "size": [1.5239999389648438, 0.5989390182495117, 0.7577880096435547], "scale": [1, 1, 1],
             "position": [-3.894610322792662, -3.045700242700519, 1.4898446144551093e-16], "rotation": [0, 0, 0],
             "entityId": "11345"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_14 = {
    "house_id": "14", "room_id": "undefined-4281", "house_data": {},
    "room_data": {"id": "undefined-4281", "type": "", "style": "", "area": 10.064373445545, "height": 2.8,
                  "floor": [-4.513637, 1.019167, -1.613232, 1.019167, -1.613232, -2.450822, -4.513637, -2.450822],
                  "door_info": [{"pts": [-2.740157632, 1.259166656, -2.740157632, 1.019166656, -2.00123872, 1.019166656,
                                         -2.00123872, 1.259166656], "to": "undefined-5177"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [{"pts": [-2.6170044800000003, -2.570822048, -4.1872071680000005,
                                                                 -2.570822048, -4.1872071680000005, -2.8108220480000004,
                                                                 -4.241207168000001, -2.8108220480000004,
                                                                 -4.241207168000001, -3.4248220480000002, -2.56300448,
                                                                 -3.4248220480000002, -2.56300448, -2.8108220480000004,
                                                                 -2.6170044800000003, -2.8108220480000004,
                                                                 -2.6170044800000003, -2.570822048], "to": "",
                                                         "height": 0.5}], "furniture_info": [
            {"id": "7aedd19e-c9a3-42f1-a156-ffcebf1d43c8", "type": "bed/bed set", "style": "其他",
             "size": [3.4829298200000007, 2.084089965820313, 2.3000000317743683], "scale": [1, 1, 1],
             "position": [-3.4715923610898436, -0.7093571379999992, 0], "rotation": [0, 0, -90], "entityId": "6750"}],
                  "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_15 = {
    "house_id": "15", "room_id": "undefined-7082", "house_data": {},
    "room_data": {"id": "undefined-7082", "type": "", "style": "", "area": 18.62403865910401, "height": 2.8,
                  "floor": [-1.447246, -1.542553, -1.447246, -6.953897, -4.888912, -6.953897, -4.888912, -1.542553],
                  "door_info": [{"pts": [-1.327246, -2.393264123385811, -1.447246, -2.393264123385811, -1.447246,
                                         -3.2404378766141892, -1.327246, -3.2404378766141892], "to": "LivingRoom-7696"},
                                {"pts": [-3.844048951907501, -1.422553, -3.844048951907501, -1.542553,
                                         -2.488571048092499, -1.542553, -2.488571048092499, -1.422553],
                                 "to": "undefined-8571"}], "hole_info": [], "window_info": [{"pts": [
            -4.3523538452269745, -6.9538969999999996, -4.3523538452269745, -7.193897, -2.0861641547730256, -7.193897,
            -2.0861641547730256, -6.9538969999999996], "to": "", "height": 0.9}], "baywindow_info": [],
                  "furniture_info": [
                      {"id": "dd98d80a-68fa-48b1-97dd-4bf9bb05b014", "type": "media unit/floor-based media unit",
                       "style": "北欧", "size": [1.9992500305175782, 0.45000099182128905, 0.5499900054931641],
                       "scale": [1, 1, 1], "position": [-1.672246495910644, -5.382148121623254, -1.37147880184224e-16],
                       "rotation": [0, 0, 90], "entityId": "17221"}], "decorate_info": []}, "layout_number": 2,
    "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "",
    "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_16 = {
    "house_id": "16", "room_id": "KidsRoom-12702", "house_data": {},
    "room_data": {"id": "KidsRoom-12702", "type": "KidsRoom", "style": "", "area": 14.510457950563005, "height": 2.6,
                  "floor": [-3.283805, 2.638969, -3.283805, 2.931363, -4.942664, 2.955685, -4.942664, 7.134597,
                            -1.602603, 7.134597, -1.602603, 2.638969], "door_info": [{"pts": [-1.8569027793124009,
                                                                                              2.3989689999999997,
                                                                                              -1.8569027793124007,
                                                                                              2.638969,
                                                                                              -2.565023220687599,
                                                                                              2.638969,
                                                                                              -2.5650232206875994,
                                                                                              2.3989689999999997],
                                                                                      "to": "Kitchen-12746"}],
                  "hole_info": [], "window_info": [{"pts": [-4.395940581650129, 7.134597, -4.395940581650129,
                                                            7.3745970000000005, -2.592871847699611, 7.3745970000000005,
                                                            -2.592871847699611, 7.134597, -4.395940581650129, 7.134597],
                                                    "to": "", "height": 0.2}], "baywindow_info": [], "furniture_info": [
            {"id": "b373fd80-0681-4bee-941d-7b937c25f4e8", "type": "table/table", "style": "其他",
             "size": [1.4809500122070314, 0.5011050033569336, 1.8863299560546876], "scale": [1, 1, 1],
             "position": [-3.1842046408369415, 4.932460500261841, 9.329206833926423e-19], "rotation": [0, 0, 0],
             "entityId": "22776"}], "decorate_info": [
            {"id": "f4839c59-6384-43eb-a59b-f0babd9bac26", "type": "extrusion customized background wall", "style": "",
             "size": [0.20000000000000107, 4.178912000000001, 2.599999999999999], "scale": [1, 1, 1],
             "position": [-4.842663999999999, 5.045141471351296, 1.3], "rotation": [0, 0, 0], "entityId": "22207"}]},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "",
    "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_17 = {
    "house_id": "17", "room_id": "undefined-4281", "house_data": {},
    "room_data": {"id": "undefined-4281", "type": "", "style": "", "area": 10.064373445545, "height": 2.8,
                  "floor": [-4.513637, 1.019167, -1.613232, 1.019167, -1.613232, -2.450822, -4.513637, -2.450822],
                  "door_info": [{"pts": [-2.740157286713638, 1.2591670000000001, -2.740157286713638, 1.019167,
                                         -2.001238713286362, 1.019167, -2.001238713286362, 1.2591670000000001],
                                 "to": "undefined-5177"}], "hole_info": [], "window_info": [], "baywindow_info": [{
            "pts": [
                -2.6170045,
                -2.450822,
                -4.1872074999999995,
                -2.450822,
                -4.1872074999999995,
                -2.690822,
                -4.2412075,
                -2.690822,
                -4.2412075,
                -3.304822,
                -2.5630045,
                -3.304822,
                -2.5630045,
                -2.690822,
                -2.6170045,
                -2.690822,
                -2.6170045,
                -2.450822],
            "to": "",
            "height": 0.5}],
                  "furniture_info": [
                      {"id": "4297c775-421f-4a15-ab59-2b5b3adbffdc", "type": "table/table", "style": "现代",
                       "size": [1.5239999389648438, 0.5989390182495117, 0.7577880096435547], "scale": [1, 1, 1],
                       "position": [-3.224613669736773, -0.8806649876847226, -2.4495499146368028e-17],
                       "rotation": [0, 0, 0], "entityId": "7688"}], "decorate_info": []}, "layout_number": 2,
    "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "",
    "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_18 = {
    "house_id": "18", "room_id": "KidsRoom-5415", "house_data": {},
    "room_data": {"id": "KidsRoom-5415", "type": "KidsRoom", "style": "", "area": 13.598920231386, "height": 2.6,
                  "floor": [2.408954, -0.09697, 5.81092, -0.09697, 5.81092, -4.094341, 2.408954, -4.094341],
                  "door_info": [{"pts": [3.3237657336768343, -0.09696999999999995, 3.3237657336768343,
                                         0.14303000000000005, 2.523740266323166, 0.14302999999999993, 2.523740266323166,
                                         -0.09697000000000006], "to": "Corridor-9722"}], "hole_info": [],
                  "window_info": [{"pts": [3.2740377644381713, -4.094341, 3.2740377644381713, -4.334341,
                                           5.125004235561828, -4.334341, 5.125004235561828, -4.094341], "to": "",
                                   "height": 0.85}], "baywindow_info": [], "furniture_info": [
            {"id": "9556a5c9-6d6a-4500-851f-571a5a0494aa", "type": "table/table", "style": "地中海",
             "size": [1.3266099548339845, 0.5735150146484375, 1.8659800720214843], "scale": [1, 1, 1],
             "position": [5.147615022583008, -2.1914724657186238, -6.7023935041948895e-18], "rotation": [0, 0, 0],
             "entityId": "19564"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_19 = {
    "house_id": "19", "room_id": "Bedroom-6006", "house_data": {},
    "room_data": {"id": "Bedroom-6006", "type": "Bedroom", "style": "Nordic", "area": 10.402523879850001, "height": 2.6,
                  "floor": [3.352065, 0.70967, 0.94799, 0.70967, 0.94799, 5.036708, 3.352065, 5.036708],
                  "door_info": [], "hole_info": [{"pts": [3.352065, 0.8477619999999999, 3.5920650000000003,
                                                          0.8477619999999999, 3.5920650000000003, 1.847762, 3.352065,
                                                          1.847762], "to": ""}], "window_info": [{"pts": [
            2.6085101834948734, 5.036708, 2.6085101834948734, 5.276708, 1.783705816505127, 5.276708, 1.7837058165051272,
            5.036708], "to": "", "height": 0.85}], "baywindow_info": [], "furniture_info": [], "decorate_info": [
            {"id": "480d6c31-2bcd-44b0-870d-436e159031fa", "type": "extrusion customized background wall", "style": "",
             "size": [0.4, 4.327038, 2.6], "scale": [1, 1, 1], "position": [1.14799, 2.873189, 1.3],
             "rotation": [0, 0, 0], "entityId": "13841"}]},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "",
    "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_19_v2 = {
    "house_id": "19_v2", "room_id": "Bedroom-899", "house_data": {},
    "room_data":{"id":"Bedroom-899","type":"Bedroom","style":"Nordic","area":20.694282291963997,"height":2.8,"floor":[-2.5362270000000002,-2.7284029999999997,-2.5362270000000002,2.7514879999999997,1.2401769999999996,2.7514879999999997,1.2401769999999996,-2.7284029999999997],"door_info":[{"pts":[1.4801769999999999,0.9277530547201629,1.2401769999999999,0.9277530547201629,1.240177,-0.5622469452798371,1.480177,-0.5622469452798371],"to":""}],"hole_info":[],"window_info":[{"pts":[-2.536227,-0.39345211944637115,-2.776227,-0.3934521194463714,-2.776227,-2.4889521194463713,-2.536227,-2.4889521194463713],"to":"","height":0.2,"indent":0.12}],"baywindow_info":[],"furniture_info":[],"decorate_info":[]},
    "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
# 布局算法接口 测试输入:单屋设计 卫生间
smart_decoration_input_layout_test_20 = {
    "house_id": "29", "room_id": "Bathroom-13346", "house_data": {},
    "room_data": {"id": "Bathroom-13346", "type": "Bathroom", "style": "european", "area": 5.226827235336,
                  "height": 2.8,
                  "floor": [0.011545, 5.161642, 1.539029, 5.161642, 1.539029, 1.739788, 0.011545, 1.739788],
                  "door_info": [{"pts": [0.678375565102, 1.7397880000000001, 0.678375565102, 1.619788, 1.453662434898,
                                         1.619788, 1.453662434898, 1.7397880000000001], "to": "LivingRoom-13653"}],
                  "hole_info": [], "window_info": [{"pts": [1.405207363372, 5.161642, 1.405207363372, 5.401642,
                                                            0.952956636628, 5.401642, 0.952956636628, 5.161642],
                                                    "to": "", "height": 0.9}], "baywindow_info": [],
                  "furniture_info": [], "decorate_info": []}, "layout_number": 2, "propose_number": 3,
    "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_21 = {
    "house_id": "21", "room_id": "Bathroom-2709", "house_data": {},
    "room_data": {"id": "Bathroom-2709", "type": "Bathroom", "style": "", "area": 8.846270153524, "height": 2.6,
                  "floor": [0.988621, 5.125587, -1.31677, 5.125587, -1.31677, 6.711302, 2.557678, 6.711302, 2.557678,
                            3.403215, 0.988621, 3.403215], "door_info": [{"pts": [1.6280152663231657,
                                                                                  3.4032150000000003,
                                                                                  1.6280152663231657, 3.163215,
                                                                                  2.428040733676834, 3.163215,
                                                                                  2.428040733676834,
                                                                                  3.4032150000000003],
                                                                          "to": "LivingRoom-2687"}, {
                                                                             "pts": [2.3535754741563415, 6.711302,
                                                                                     2.353575474156342, 6.951302,
                                                                                     1.6316585258436587, 6.951302,
                                                                                     1.6316585258436584, 6.711302],
                                                                             "to": ""}, {
                                                                             "pts": [0.868621, 3.9326362663231658,
                                                                                     0.988621, 3.9326362663231658,
                                                                                     0.9886210000000001,
                                                                                     4.732661733676834,
                                                                                     0.8686210000000001,
                                                                                     4.732661733676834],
                                                                             "to": "Bathroom-631"}], "hole_info": [],
                  "window_info": [{"pts": [0.3450613180032349, 6.711302, 0.3450613180032349, 6.951302,
                                           -0.4254553180032349, 6.951302, -0.4254553180032349, 6.711302], "to": "",
                                   "height": 0.85}], "baywindow_info": [], "furniture_info": [
            {"id": "1d69e073-c249-457d-93b6-4cbb2eb8706b", "type": "toilet/floor-based toilet", "style": "现代",
             "size": [0.4542309951782227, 0.7502989959716797, 0.8053330230712891], "scale": [1, 1, 1],
             "position": [-0.9416205020141607, 6.16166887382929, 1.3391727834627823e-16], "rotation": [0, 0, -90],
             "entityId": "8194"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_22 = {
    "house_id": "22", "room_id": "SecondBathroom-12746", "house_data": {},
    "room_data": {"id": "SecondBathroom-12746", "type": "SecondBathroom", "style": "", "area": 7.842081856803,
                  "height": 2.6,
                  "floor": [0.568878, 5.697006, 0.568878, 1.663443, -1.422603, 1.663443, -1.422603, 2.518969, -1.362603,
                            2.518969, -1.362603, 5.697006], "door_info": [{"pts": [0.568878, 2.860848, 0.688878,
                                                                                   2.860848, 0.6888780000000001,
                                                                                   4.387698, 0.5688780000000001,
                                                                                   4.387698],
                                                                           "to": "DiningRoom-12816"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [], "furniture_info": [
            {"id": "bee55151-a61e-4b94-8574-bde6b4f5e642", "type": "toilet/floor-based toilet", "style": "现代",
             "size": [0.37858100891113283, 0.6492430114746094, 0.7098799896240234], "scale": [1, 1, 1],
             "position": [-1.0379814942626946, 3.21927696773482, -5.204170427930421e-17], "rotation": [0, 0, -90],
             "entityId": "33450"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_23 = {
    "house_id": "23", "room_id": "Bathroom-12724", "house_data": {},
    "room_data": {"id": "Bathroom-12724", "type": "Bathroom", "style": "chinese", "area": 5.3200564871994995,
                  "height": 2.6,
                  "floor": [-3.523805, 2.518969, -3.463805, 2.518969, -3.463805, 0.606999, -5.998519, 0.606999,
                            -5.998519, 2.717432, -5.063544, 2.717432, -3.523805, 2.694857], "door_info": [{"pts": [
            -3.343805, 2.3362653398736954, -3.4638050000000002, 2.3362653398736954, -3.4638050000000002,
            1.6364926601263043, -3.343805, 1.6364926601263046], "to": "Corridor-12674"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [], "furniture_info": [], "decorate_info": []},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "",
    "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_24 = {
    "house_id": "24", "room_id": "Bathroom-7747", "house_data": {},
    "room_data": {"id": "Bathroom-7747", "type": "Bathroom", "style": "", "area": 5.5154820814960015, "height": 2.6,
                  "floor": [3.911302, 1.704555, 4.255083, 1.704555, 4.255083, 3.348723, 6.242184, 3.348723, 6.242184,
                            0.754051, 3.851302, 0.754051, 3.851302, 1.30141, 3.911302, 1.30141], "door_info": [{"pts": [
            4.835450503470116, 0.754051, 4.835450503470116, 0.6340509999999999, 5.543313496529884, 0.6340509999999999,
            5.543313496529884, 0.754051], "to": "CloakRoom-7888"}], "hole_info": [], "window_info": [{"pts": [5.7051374,
                                                                                                              3.3487229999999997,
                                                                                                              5.7051374,
                                                                                                              3.588723,
                                                                                                              4.5648806,
                                                                                                              3.588723,
                                                                                                              4.5648806,
                                                                                                              3.3487229999999997],
                                                                                                      "to": "",
                                                                                                      "height": 0.45}],
                  "baywindow_info": [], "furniture_info": [
            {"id": "1234687e-5967-42a4-8c6a-ce0f3f7670c4", "type": "cabinet/floor-based cabinet", "style": "现代",
             "size": [0.7650099945068359, 0.5589690017700195, 1.8524299621582032], "scale": [1, 1, 1],
             "position": [5.962699499114989, 2.629237117597675, 7.148295149829466e-17], "rotation": [0, 0, 90],
             "entityId": "17698"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_25 = {
    "house_id": "25", "room_id": "Bathroom-7763", "house_data": {},
    "room_data": {"id": "Bathroom-7763", "type": "Bathroom", "style": "european", "area": 3.4641023460299993,
                  "height": 2.6,
                  "floor": [-0.572793, 3.81208, 0.876216, 3.81208, 0.876216, 1.42141, -0.572793, 1.42141],
                  "door_info": [{"pts": [0.8189169494968795, 1.1814099999999998, 0.8189169494968795, 1.4214099999999998,
                                         0.15938505050312046, 1.42141, 0.1593850505031204, 1.18141],
                                 "to": "LivingDiningRoom-7812"}], "hole_info": [], "window_info": [{"pts": [0.7511658,
                                                                                                            3.81208,
                                                                                                            0.7511658000000001,
                                                                                                            4.05208,
                                                                                                            -0.2561798,
                                                                                                            4.05208,
                                                                                                            -0.25617980000000007,
                                                                                                            3.81208],
                                                                                                    "to": "",
                                                                                                    "height": 0.45}],
                  "baywindow_info": [], "furniture_info": [], "decorate_info": []}, "layout_number": 2,
    "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "",
    "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_26 = {
    "house_id": "26", "room_id": "Bathroom-631", "house_data": {},
    "room_data": {"id": "Bathroom-631", "type": "Bathroom", "style": "", "area": 3.5018093474520007, "height": 2.6,
                  "floor": [0.868621, 3.403215, -1.31677, 3.403215, -1.31677, 5.005587, 0.868621, 5.005587],
                  "door_info": [{"pts": [0.868621, 3.9326362663231658, 0.988621, 3.9326362663231658, 0.9886210000000001,
                                         4.732661733676834, 0.8686210000000001, 4.732661733676834],
                                 "to": "Kitchen-2709"}], "hole_info": [], "window_info": [{"pts": [-1.3167700000000002,
                                                                                                   4.540164318003235,
                                                                                                   -1.5567700000000002,
                                                                                                   4.540164318003235,
                                                                                                   -1.55677,
                                                                                                   3.7696476819967657,
                                                                                                   -1.31677,
                                                                                                   3.7696476819967657],
                                                                                           "to": "", "height": 0.85}],
                  "baywindow_info": [], "furniture_info": [
            {"id": "cf390ba8-9589-4cdc-80ea-1d8b0bf804ea", "type": "toilet/floor-based toilet", "style": "极简",
             "size": [0.4877410125732422, 0.8038690185546875, 0.6737660217285156], "scale": [1, 1, 1],
             "position": [-0.6306782627647546, 3.8051495092773444, -6.825182896210016e-17], "rotation": [0, 0, 180],
             "entityId": "8089"}], "decorate_info": []}, "layout_number": 2, "propose_number": 3, "sample_house": "",
    "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_27 = {
    "house_id": "27", "room_id": "SecondBathroom-12746", "house_data": {},
    "room_data": {"id": "SecondBathroom-12746", "type": "SecondBathroom", "style": "chinese", "area": 7.842081856803,
                  "height": 2.6,
                  "floor": [0.568878, 5.697006, 0.568878, 1.663443, -1.422603, 1.663443, -1.422603, 2.518969, -1.362603,
                            2.518969, -1.362603, 5.697006], "door_info": [{"pts": [0.568878, 2.860848, 0.688878,
                                                                                   2.860848, 0.6888780000000001,
                                                                                   4.387698, 0.5688780000000001,
                                                                                   4.387698],
                                                                           "to": "DiningRoom-12816"}], "hole_info": [],
                  "window_info": [], "baywindow_info": [], "furniture_info": [], "decorate_info": []},
    "layout_number": 2, "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "",
    "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_28 = {
    "house_id": "28", "room_id": "Bathroom-7763", "house_data": {},
    "room_data": {"id": "Bathroom-7763", "type": "Bathroom", "style": "Nordic", "area": 3.4641023460299993,
                  "height": 2.6,
                  "floor": [-0.572793, 3.81208, 0.876216, 3.81208, 0.876216, 1.42141, -0.572793, 1.42141],
                  "door_info": [{"pts": [0.8189169494968795, 1.1814099999999998, 0.8189169494968795, 1.4214099999999998,
                                         0.15938505050312046, 1.42141, 0.1593850505031204, 1.18141],
                                 "to": "LivingDiningRoom-7812"}], "hole_info": [], "window_info": [{"pts": [0.7511658,
                                                                                                            3.81208,
                                                                                                            0.7511658000000001,
                                                                                                            4.05208,
                                                                                                            -0.2561798,
                                                                                                            4.05208,
                                                                                                            -0.25617980000000007,
                                                                                                            3.81208],
                                                                                                    "to": "",
                                                                                                    "height": 0.45}],
                  "baywindow_info": [], "furniture_info": [], "decorate_info": []}, "layout_number": 2,
    "propose_number": 3, "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "",
    "image_url": "",
    "scheme_mode": "frame layout propose"
}
smart_decoration_input_layout_test_29 = {
    "house_id": "29", "room_id": "Bathroom-13346", "house_data": {},
    "room_data": {"id": "Bathroom-13346", "type": "Bathroom", "style": "european", "area": 5.226827235336,
                  "height": 2.8,
                  "floor": [0.011545, 5.161642, 1.539029, 5.161642, 1.539029, 1.739788, 0.011545, 1.739788],
                  "door_info": [{"pts": [0.678375565102, 1.7397880000000001, 0.678375565102, 1.619788, 1.453662434898,
                                         1.619788, 1.453662434898, 1.7397880000000001], "to": "LivingRoom-13653"}],
                  "hole_info": [], "window_info": [{"pts": [1.405207363372, 5.161642, 1.405207363372, 5.401642,
                                                            0.952956636628, 5.401642, 0.952956636628, 5.161642],
                                                    "to": "", "height": 0.9}], "baywindow_info": [],
                  "furniture_info": [], "decorate_info": []}, "layout_number": 2, "propose_number": 3,
    "sample_house": "", "sample_room": "", "data_idx": 0, "data_url": "", "scene_url": "", "image_url": "",
    "scheme_mode": "frame layout propose"
}
# 布局算法接口 测试输入:单屋设计 批量测试
smart_decoration_input_layout_list_00 = [
    smart_decoration_input_layout_test_00, smart_decoration_input_layout_test_01, smart_decoration_input_layout_test_02,
    smart_decoration_input_layout_test_03, smart_decoration_input_layout_test_04, smart_decoration_input_layout_test_05,
    smart_decoration_input_layout_test_06, smart_decoration_input_layout_test_07, smart_decoration_input_layout_test_08,
    smart_decoration_input_layout_test_09
]
smart_decoration_input_layout_list_01 = [
    smart_decoration_input_layout_test_10, smart_decoration_input_layout_test_11, smart_decoration_input_layout_test_12,
    smart_decoration_input_layout_test_13, smart_decoration_input_layout_test_14, smart_decoration_input_layout_test_15,
    smart_decoration_input_layout_test_16, smart_decoration_input_layout_test_17, smart_decoration_input_layout_test_18,
    smart_decoration_input_layout_test_19
]
smart_decoration_input_layout_list_02 = [
    smart_decoration_input_layout_test_20, smart_decoration_input_layout_test_21, smart_decoration_input_layout_test_22,
    smart_decoration_input_layout_test_23, smart_decoration_input_layout_test_24, smart_decoration_input_layout_test_25,
    smart_decoration_input_layout_test_26, smart_decoration_input_layout_test_27, smart_decoration_input_layout_test_28,
    smart_decoration_input_layout_test_29
]

# 布局算法接口 测试输入:单屋锚点
smart_decoration_input_anchor_test_00 = {
    "house_id": "72989ffd-6a22-4c8f-84b5-a90b9eee62eb", "room_id": "",
    "house_data": {}, "room_data": {},
    "house_anchor": [],
    "layout_number": 1, "propose_number": 3, "layout_mode": 1,
    "scheme_mode": "frame layout propose output"
}
# 布局算法接口 测试输入:全屋锚点
smart_decoration_input_anchor_test_10 = {
    "house_id": "72989ffd-6a22-4c8f-84b5-a90b9eee62eb", "room_id": "",
    "house_data": {}, "room_data": {},
    "house_anchor": [],
    "layout_number": 1, "propose_number": 3, "layout_mode": 1,
    "scheme_mode": "frame layout propose output"
}

# 布局算法接口 测试输入:全屋迁移 开放厨房 联合绿植 可能飘窗
smart_decoration_input_transfer_test_99 = {
    "house_data": {
        "style": "emptyStyle",
        "room": [
            {
                "id": "4509",
                "type": "Kitchen",
                "area": 8.65552976,
                "height": 2.8,
                "floor": [
                    1.84038,
                    -2.132816,
                    -0.237016,
                    -2.132816,
                    -0.237016,
                    -2.072816,
                    -0.597016,
                    -2.072816,
                    -0.597016,
                    1.427184,
                    1.84038,
                    1.427184
                ],
                "door_info": [
                    {
                        "pts": [
                            1.84038,
                            -1.1490179999999999,
                            1.96038,
                            -1.1490179999999999,
                            1.96038,
                            0.3409819999999999,
                            1.84038,
                            0.340982
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "1eebceb1-bc0e-4e85-ac1c-72ce7cdead52",
                        "type": "door/double sliding door",
                        "style": "其他",
                        "size": [
                            1.49,
                            0.12,
                            2.1
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.90038,
                            -0.404018,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "32966"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            0.14400799999999997,
                            1.427184,
                            0.14400799999999997,
                            1.667184,
                            0.994008,
                            1.667184,
                            0.994008,
                            1.427184,
                            0.14400799999999997,
                            1.427184
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.8500000000000001,
                            0.24,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0.569008,
                            1.427184,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "32959"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": [
                    {
                        "id": "33da6b5a-7f90-4615-b876-c359092ce8b5",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.9,
                            0.9,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.14701599999999998,
                            0.9771839999999999,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55785",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "8ce4ed58-4224-34ef-84b2-4af77db15733",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.30000000000000016,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.31901599999999997,
                            0.37718399999999985,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55816",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "8ce4ed58-4224-34ef-84b2-4af77db15733",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.6999999999999997,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.31901599999999997,
                            -1.7228160000000001,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55840",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "8ce4ed58-4224-34ef-84b2-4af77db15733",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.6000000000000001,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.5403799999999999,
                            1.149184,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "55864",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "4f4beb7d-479c-31ea-ac60-b6043b42702e",
                        "type": "kitchen cabinet/wall cabinet",
                        "style": "",
                        "size": [
                            0.6000000000000002,
                            0.326,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.43401599999999996,
                            0.5271839999999999,
                            1.5
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55888",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "e2e27f8d-6260-347a-bdc7-f31e89a0714b",
                        "type": "kitchen cabinet/wall cabinet",
                        "style": "",
                        "size": [
                            0.7000000000000002,
                            0.326,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.43401599999999996,
                            -1.1228160000000003,
                            1.5
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55912",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "4f4beb7d-479c-31ea-ac60-b6043b42702e",
                        "type": "kitchen cabinet/wall cabinet",
                        "style": "",
                        "size": [
                            0.5999999999999996,
                            0.326,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.43401599999999996,
                            -1.7728160000000002,
                            1.5
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "55941",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "e2e27f8d-6260-347a-bdc7-f31e89a0714b",
                        "type": "kitchen cabinet/wall cabinet",
                        "style": "",
                        "size": [
                            0.7263719999999999,
                            0.326,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.477194,
                            1.264184,
                            1.5
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "55965",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "274df272-0df4-4a2e-b1f5-14f2411b5986",
                        "type": "customized content/smart customized ceiling",
                        "style": "",
                        "size": [
                            2.437196,
                            3.5598,
                            0.15
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0.621682,
                            -0.3528159999999999,
                            2.65
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56002",
                        "categories": []
                    },
                    {
                        "id": "0ddc88c9-54e6-3e1f-b459-da55d7a17f11",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            1,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.31901599999999997,
                            -0.27281600000000017,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "56011",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "f68a7788-a7c8-3513-a295-e04a31c5ddb1",
                        "type": "kitchen cabinet/wall cabinet",
                        "style": "",
                        "size": [
                            1,
                            0.326,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.43401599999999996,
                            -0.27281600000000017,
                            1.5
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "56041",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "e96fb05c-bde4-35ad-bf22-77233f7e4ec7",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.6000000000000001,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.31901599999999997,
                            -1.0728160000000002,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            270
                        ],
                        "entityId": "56085",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "fbb0f4a0-359f-3a3c-830e-3fb43a481d8a",
                        "type": "kitchen cabinet/base cabinet",
                        "style": "",
                        "size": [
                            0.9373959999999992,
                            0.556,
                            0.7
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0.7716820000000002,
                            1.149184,
                            0.1
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56104",
                        "categories": [
                            "7cb238c3-4dd3-4aa6-9b95-93a4434b817a"
                        ]
                    },
                    {
                        "id": "b819854a-bc28-4a45-9910-c30f204c2adb",
                        "type": "kitchen cabinet/base molding",
                        "size": [
                            0,
                            0,
                            0
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0,
                            0,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56140"
                    },
                    {
                        "id": "0cd366d1-28fc-4223-b160-7c9a1149b27c",
                        "type": "kitchen cabinet/crown molding",
                        "size": [
                            0,
                            0,
                            0
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0,
                            0,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56144"
                    },
                    {
                        "id": "0cd366d1-28fc-4223-b160-7c9a1149b27c",
                        "type": "kitchen cabinet/crown molding",
                        "size": [
                            0,
                            0,
                            0
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            0,
                            0,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56148"
                    }
                ]
            },
            {
                "id": "30018",
                "type": "LivingDiningRoom",
                "area": 49.781394719960005,
                "height": 2.8,
                "floor": [
                    5.571195,
                    -9.692816,
                    4.297001,
                    -9.692816,
                    4.297001,
                    -6.502816,
                    2.505897,
                    -6.502816,
                    2.505897,
                    -4.138461,
                    0.953019,
                    -4.138461,
                    0.953019,
                    -3.671206,
                    -0.117016,
                    -3.671206,
                    -0.117016,
                    -2.252816,
                    1.96038,
                    -2.252816,
                    1.96038,
                    1.427184,
                    4.84038,
                    1.427184,
                    4.84038,
                    -2.012816,
                    9.188381,
                    -2.012816,
                    9.188381,
                    -6.792816,
                    8.56038,
                    -6.792816,
                    8.56038,
                    -6.852816,
                    5.571195,
                    -6.852816
                ],
                "door_info": [
                    {
                        "pts": [
                            1.84038,
                            -1.1490179999999999,
                            1.96038,
                            -1.1490179999999999,
                            1.96038,
                            0.3409819999999999,
                            1.84038,
                            0.340982
                        ],
                        "to": "Kitchen-4509",
                        "id": "1eebceb1-bc0e-4e85-ac1c-72ce7cdead52",
                        "type": "door/double sliding door",
                        "style": "其他",
                        "size": [
                            1.49,
                            0.12,
                            2.1
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.90038,
                            -0.404018,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "32966"
                    },
                    {
                        "pts": [
                            -0.11701600000000004,
                            -2.617512,
                            -0.357016,
                            -2.617512,
                            -0.357016,
                            -3.531716,
                            -0.11701599999999998,
                            -3.531716
                        ],
                        "to": "",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.24,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.237016,
                            -3.074614,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            90
                        ],
                        "entityId": "33031"
                    },
                    {
                        "pts": [
                            0.833018292246,
                            -3.791206,
                            0.833018292246,
                            -3.6712059999999997,
                            -0.05099229224599999,
                            -3.6712059999999997,
                            -0.05099229224599999,
                            -3.791206
                        ],
                        "to": "Bathroom-30111",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.884010584492,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            0.966973,
                            1,
                            1
                        ],
                        "position": [
                            0.391013,
                            -3.731206,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -180
                        ],
                        "entityId": "33096"
                    },
                    {
                        "pts": [
                            4.177001000000001,
                            -9.225627000000001,
                            4.297001,
                            -9.225627000000001,
                            4.297001,
                            -8.311423,
                            4.177001000000001,
                            -8.311423
                        ],
                        "to": "Bedroom-33666",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.237001,
                            -8.768525,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34379"
                    },
                    {
                        "pts": [
                            4.4201310000000005,
                            -9.692815999999999,
                            4.4201310000000005,
                            -9.812816,
                            5.334335,
                            -9.812816,
                            5.334335,
                            -9.692815999999999
                        ],
                        "to": "Bedroom-30069",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.877233,
                            -9.752816,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34444"
                    },
                    {
                        "pts": [
                            5.571195,
                            -7.88702,
                            5.691195,
                            -7.88702,
                            5.691195,
                            -6.972816,
                            5.571195,
                            -6.972816
                        ],
                        "to": "Library-30048",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            5.631195,
                            -7.429918,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34314"
                    },
                    {
                        "pts": [
                            4.840380000000001,
                            -1.8928159999999998,
                            4.96038,
                            -1.8928159999999998,
                            4.96038,
                            -0.978612,
                            4.840380000000001,
                            -0.9786119999999999
                        ],
                        "to": "Bedroom-30033",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.90038,
                            -1.435714,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34249"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            2.7998700000000003,
                            1.427184,
                            2.7998700000000003,
                            1.667184,
                            3.64987,
                            1.667184,
                            3.64987,
                            1.427184,
                            2.7998700000000003,
                            1.427184
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.8499999999999996,
                            0.24,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            3.22487,
                            1.427184,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34235"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "30033",
                "type": "Bedroom",
                "area": 11.1552,
                "height": 2.8,
                "floor": [
                    8.32038,
                    -1.892816,
                    4.96038,
                    -1.892816,
                    4.96038,
                    1.427184,
                    8.32038,
                    1.427184
                ],
                "door_info": [
                    {
                        "pts": [
                            4.840380000000001,
                            -1.8928159999999998,
                            4.96038,
                            -1.8928159999999998,
                            4.96038,
                            -0.978612,
                            4.840380000000001,
                            -0.9786119999999999
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.90038,
                            -1.435714,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34249"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            6.115057,
                            1.427184,
                            6.115057,
                            1.667184,
                            6.965057,
                            1.667184,
                            6.965057,
                            1.427184,
                            6.115057,
                            1.427184
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.8499999999999996,
                            0.24,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            6.540057,
                            1.427184,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34242"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": [
                    {
                        "id": "470b3fa6-c941-4a7d-b2e0-2c9621f52c25",
                        "type": "build element/background wall",
                        "style": "现代",
                        "size": [
                            2.407368,
                            0.0120004,
                            2.4
                        ],
                        "scale": [
                            0.6079212121212121,
                            1,
                            0.96
                        ],
                        "position": [
                            8.31338,
                            0.22350000000000025,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -270
                        ],
                        "entityId": "55718",
                        "categories": [
                            "fda8e92c-9959-4eef-8b71-c1bce298b55b"
                        ]
                    }
                ]
            },
            {
                "id": "30048",
                "type": "Library",
                "area": 7.44178320000001,
                "height": 2.8,
                "floor": [
                    7.84038,
                    -9.692816,
                    5.691195,
                    -9.692816,
                    5.691195,
                    -6.972816,
                    8.44038,
                    -6.972816,
                    8.44038,
                    -9.632816,
                    7.84038,
                    -9.632816
                ],
                "door_info": [
                    {
                        "pts": [
                            5.571195,
                            -7.88702,
                            5.691195,
                            -7.88702,
                            5.691195,
                            -6.972816,
                            5.571195,
                            -6.972816
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            5.631195,
                            -7.429918,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34314"
                    }
                ],
                "hole_info": [],
                "window_info": [],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "30069",
                "type": "Bedroom",
                "area": 15.13133518,
                "height": 2.8,
                "floor": [
                    4.297001,
                    -14.232816,
                    4.297001,
                    -9.812816,
                    7.72038,
                    -9.812816,
                    7.72038,
                    -14.232816
                ],
                "door_info": [
                    {
                        "pts": [
                            4.4201310000000005,
                            -9.692815999999999,
                            4.4201310000000005,
                            -9.812816,
                            5.334335,
                            -9.812816,
                            5.334335,
                            -9.692815999999999
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.877233,
                            -9.752816,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34444"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            5.629759,
                            -14.232816,
                            5.629759,
                            -14.472816,
                            4.779759,
                            -14.472816,
                            4.779759,
                            -14.232816,
                            5.629759,
                            -14.232816
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.8499999999999996,
                            0.2400000000000002,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            5.204759,
                            -14.232816,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34581"
                    },
                    {
                        "pts": [
                            7.116223,
                            -14.232816,
                            7.116223,
                            -14.472816,
                            6.266223,
                            -14.472816,
                            6.266223,
                            -14.232816,
                            7.116223,
                            -14.232816
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.8499999999999996,
                            0.2400000000000002,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            6.691223,
                            -14.232816,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34588"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": [
                    {
                        "id": "470b3fa6-c941-4a7d-b2e0-2c9621f52c25",
                        "type": "build element/background wall",
                        "style": "现代",
                        "size": [
                            2.953631999999999,
                            0.0120004,
                            2.4
                        ],
                        "scale": [
                            0.7458666666666665,
                            1,
                            0.96
                        ],
                        "position": [
                            7.71338,
                            -12.756,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -270
                        ],
                        "entityId": "55735",
                        "categories": [
                            "fda8e92c-9959-4eef-8b71-c1bce298b55b"
                        ]
                    }
                ]
            },
            {
                "id": "30090",
                "type": "Balcony",
                "area": 7.454791385495994,
                "height": 2.8,
                "floor": [
                    4.177001,
                    -13.696728,
                    4.177001,
                    -15.432816,
                    -0.117016,
                    -15.432816,
                    -0.117016,
                    -13.696728
                ],
                "door_info": [
                    {
                        "pts": [
                            2.32178,
                            -13.696728,
                            2.32178,
                            -13.576728,
                            0.8317800000000002,
                            -13.576728,
                            0.8317800000000001,
                            -13.696728
                        ],
                        "to": "Bedroom-33666",
                        "id": "1eebceb1-bc0e-4e85-ac1c-72ce7cdead52",
                        "type": "door/double sliding door",
                        "style": "其他",
                        "size": [
                            1.49,
                            0.12,
                            2.1
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.57678,
                            -13.636728,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -180
                        ],
                        "entityId": "34509"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            2.5812485,
                            -15.432816,
                            2.5812485,
                            -15.672816000000001,
                            1.1265855,
                            -15.672816000000001,
                            1.1265855,
                            -15.432816,
                            2.5812485,
                            -15.432816
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            1.454663,
                            0.2400000000000002,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.853917,
                            -15.432816,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "34574"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "30111",
                "type": "Bathroom",
                "area": 6.061333910040003,
                "height": 2.8,
                "floor": [
                    2.385897,
                    -6.502816,
                    -0.117016,
                    -6.502816,
                    -0.117016,
                    -3.791206,
                    0.833019,
                    -3.791206,
                    0.833019,
                    -4.258461,
                    2.385897,
                    -4.258461
                ],
                "door_info": [
                    {
                        "pts": [
                            0.833018292246,
                            -3.791206,
                            0.833018292246,
                            -3.6712059999999997,
                            -0.05099229224599999,
                            -3.6712059999999997,
                            -0.05099229224599999,
                            -3.791206
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.884010584492,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            0.966973,
                            1,
                            1
                        ],
                        "position": [
                            0.391013,
                            -3.731206,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -180
                        ],
                        "entityId": "33096"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            -0.117016,
                            -4.986077,
                            -0.35701599999999994,
                            -4.986077,
                            -0.35701599999999994,
                            -4.136077,
                            -0.117016,
                            -4.136077,
                            -0.117016,
                            -4.986077
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.23999999999999994,
                            0.8499999999999996,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.117016,
                            -4.561077,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "33161"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "30126",
                "type": "Bathroom",
                "area": 6.411912792800997,
                "height": 2.8,
                "floor": [
                    2.505897,
                    -9.067393,
                    -0.117016,
                    -9.067393,
                    -0.117016,
                    -6.622816,
                    2.505897,
                    -6.622816
                ],
                "door_info": [
                    {
                        "pts": [
                            2.505897,
                            -7.638386,
                            2.625897,
                            -7.638386,
                            2.625897,
                            -6.724182,
                            2.505897,
                            -6.724182
                        ],
                        "to": "CloakRoom-30147",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.565897,
                            -7.181284,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "33243"
                    }
                ],
                "hole_info": [],
                "window_info": [
                    {
                        "pts": [
                            -0.117016,
                            -7.606284,
                            -0.357016,
                            -7.606284,
                            -0.357016,
                            -6.756284,
                            -0.117016,
                            -6.756284,
                            -0.117016,
                            -7.606284
                        ],
                        "to": "",
                        "height": 0.85,
                        "id": "ff367fc0-8e9e-48a5-b82d-9e0eaad2c5e2",
                        "type": "window/parametric window",
                        "style": "现代",
                        "size": [
                            0.24,
                            0.8499999999999996,
                            1.6
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            -0.117016,
                            -7.181284,
                            0.85
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "33236"
                    }
                ],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "30147",
                "type": "CloakRoom",
                "area": 1.9697159475199975,
                "height": 2.8,
                "floor": [
                    4.177001,
                    -7.892696,
                    2.625897,
                    -7.892696,
                    2.625897,
                    -6.622816,
                    4.177001,
                    -6.622816
                ],
                "door_info": [
                    {
                        "pts": [
                            2.505897,
                            -7.638386,
                            2.625897,
                            -7.638386,
                            2.625897,
                            -6.724182,
                            2.505897,
                            -6.724182
                        ],
                        "to": "Bathroom-30126",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.565897,
                            -7.181284,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "33243"
                    }
                ],
                "hole_info": [],
                "window_info": [],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": []
            },
            {
                "id": "33666",
                "type": "Bedroom",
                "area": 20.669956324182994,
                "height": 2.8,
                "floor": [
                    4.177001,
                    -13.576728,
                    -0.117016,
                    -13.576728,
                    -0.117016,
                    -9.187393,
                    2.625897,
                    -9.187393,
                    2.625897,
                    -8.012696,
                    4.177001,
                    -8.012696
                ],
                "door_info": [
                    {
                        "pts": [
                            2.32178,
                            -13.696728,
                            2.32178,
                            -13.576728,
                            0.8317800000000002,
                            -13.576728,
                            0.8317800000000001,
                            -13.696728
                        ],
                        "to": "Balcony-30090",
                        "id": "1eebceb1-bc0e-4e85-ac1c-72ce7cdead52",
                        "type": "door/double sliding door",
                        "style": "其他",
                        "size": [
                            1.49,
                            0.12,
                            2.1
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            1.57678,
                            -13.636728,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -180
                        ],
                        "entityId": "34509"
                    },
                    {
                        "pts": [
                            4.177001000000001,
                            -9.225627000000001,
                            4.297001,
                            -9.225627000000001,
                            4.297001,
                            -8.311423,
                            4.177001000000001,
                            -8.311423
                        ],
                        "to": "LivingDiningRoom-30018",
                        "id": "6124718c-40c3-4b7a-b3d3-c53374403c8a",
                        "type": "door/entry/single swing door",
                        "style": "其他",
                        "size": [
                            0.914204,
                            0.12,
                            2.15926
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            4.237001,
                            -8.768525,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "34379"
                    }
                ],
                "hole_info": [],
                "window_info": [],
                "baywindow_info": [],
                "furniture_info": [],
                "decorate_info": [
                    {
                        "id": "470b3fa6-c941-4a7d-b2e0-2c9621f52c25",
                        "type": "build element/background wall",
                        "style": "现代",
                        "size": [
                            3.659455999999999,
                            0.0120004,
                            2.4
                        ],
                        "scale": [
                            0.9241050505050503,
                            1,
                            0.96
                        ],
                        "position": [
                            -0.11001599999999999,
                            -11.747,
                            0
                        ],
                        "rotation": [
                            0,
                            0,
                            -90
                        ],
                        "entityId": "55784",
                        "categories": [
                            "fda8e92c-9959-4eef-8b71-c1bce298b55b"
                        ]
                    },
                    {
                        "id": "ff15f43c-2fcd-4f7b-9250-81071422b8e9",
                        "type": "customized content/smart customized ceiling",
                        "style": "",
                        "size": [
                            4.293817,
                            5.563832,
                            0.2
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.0299925,
                            -10.794712,
                            2.5999999999999996
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56006",
                        "categories": []
                    },
                    {
                        "id": "f2bb2e94-95fd-4802-bd30-3d01dfa7344a",
                        "type": "customized content/smart customized ceiling",
                        "style": "",
                        "size": [
                            4.293817,
                            5.563832,
                            0.2
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.0299925,
                            -10.794712,
                            2.5999999999999996
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56007",
                        "categories": []
                    },
                    {
                        "id": "bf9307c0-c439-4219-bc74-d65d38640894",
                        "type": "customized content/smart customized ceiling",
                        "style": "",
                        "size": [
                            4.293817,
                            5.563832,
                            0.2
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.0299925,
                            -10.794712,
                            2.5999999999999996
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56008",
                        "categories": []
                    },
                    {
                        "id": "58fa1144-6c30-4dbb-b7a8-af8a48409645",
                        "type": "customized content/smart customized ceiling",
                        "style": "",
                        "size": [
                            4.293817,
                            5.563832,
                            0.2
                        ],
                        "scale": [
                            1,
                            1,
                            1
                        ],
                        "position": [
                            2.0299925,
                            -10.794712,
                            2.5999999999999996
                        ],
                        "rotation": [
                            0,
                            0,
                            0
                        ],
                        "entityId": "56009",
                        "categories": []
                    }
                ]
            }
        ],
        "height": 2.8
    },
    "house_id": "",
    "sample_house_id": "8cd6381f-a224-4bee-896b-74df4970f672",
    "sample_house_json_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/7df44c27-d7c9-476c-8b34-6e63d967d761/v12342423/templateData.json",
    "sample_room_id": "",
    "layout_mode":0,
    "requestId": "76788116-aa42-49c6-88bf-847316f88f63",
    "traceId": "554629ec-7f88-46f1-a7aa-4d3f3104dc27",
    "scheme_mode": "frame layout propose output"
}
# 布局算法接口 测试输入:全屋迁移 联合柜体
smart_decoration_input_transfer_test_99 = {
    "house_id": '1fb15c17-568b-488a-be06-ef6ffaacbbd4',
    "sample_house_id": "7290b461-946c-49e1-9291-77d61cd0cd0f",
    "sample_room_id": "",
    "sample_house_json_url": "",
    "layout_mode":0,
    "scheme_mode": "frame layout propose output"
}
# 布局算法接口 测试输入:全屋迁移 效果不佳
smart_decoration_input_transfer_test_99 = {
    "house_id": "600ec0ef-5a19-4e18-a892-ae2e361de482",
    "sample_house_id": "2d7abea2-9d53-410c-ac28-ebc5ce27b045",
    "sample_room_id": "",
    "sample_house_json_url": "",
    "layout_mode":0,
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_transfer_test_99 = {
    "house_id": "86e3cef5-9552-4e68-b214-f01b6e7d60a7",
    "sample_house_id": "dcf3c6c8-f661-41fc-b983-822f860ae655",
    "sample_room_id": "",
    "sample_house_json_url": "",
    "layout_mode":0,
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_transfer_test_99 = {
    "house_id": "f8ac7096-48bb-473d-a25d-b7ff4e1a4bc2",
    "sample_house_id": "d76ba297-7bfb-4900-a8c0-c1fb02f89e14",
    "sample_room_id": "",
    "sample_house_json_url": "",
    "layout_mode":0,
    "scheme_mode": "frame layout propose output"
}
# 布局算法接口 测试输入:全屋迁移
smart_decoration_input_transfer_test_00 = {
    "house_data":{"style": "","room":[{"area":8.835869530532001,"window_info":[{"size":[1.4661903316,0.24,1.5000001734],"rotation":[0,0,0],"scale":[0.666329,1,0.995091],"style": "现代","entityId": "8493","to": "","id": "dc0df5cc-e51b-440d-a687-930cedf26440","position":[2.186647,-3.627559,0.9],"type": "window/window","pts":[1.4535518341999998,-3.507559,1.4535518341999998,-3.7475590000000003,2.9197421658,-3.7475590000000003,2.9197421658,-3.507559],"height":0.9}],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.7091064434609999,0.12,2.099999375],"rotation":[0,0,-90],"scale":[0.738621,1,0.988235],"style": "现代","entityId": "9204","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[0.561197,-0.985823,0],"type": "door/single swing door","pts":[0.5011969999999999,-1.3403762217305,0.6211969999999999,-1.3403762217305,0.621197,-0.6312697782695,0.501197,-0.6312697782695]}],"id": "1351","hole_info":[],"type": "Bedroom","floor":[0.621197,-3.507559,0.621197,-0.562385,3.621315,-0.562385,3.621315,-3.507559],"furniture_info":[],"height":2.8},{"area":8.524810100616003,"window_info":[{"size":[1.4409121364000002,0.24,1.5000001734],"rotation":[0,0,0],"scale":[0.654841,1,0.995091],"style": "现代","entityId": "8588","to": "","id": "dc0df5cc-e51b-440d-a687-930cedf26440","position":[-2.350961,-5.144308,0.9],"type": "window/window","pts":[-3.0714170681999997,-5.0243079999999996,-3.0714170681999997,-5.264308,-1.6305049318,-5.264308,-1.6305049317999998,-5.0243079999999996],"height":0.9}],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.7078161483569999,0.12,2.099999375],"rotation":[0,0,0],"scale":[0.737277,1,0.988235],"style": "现代","entityId": "9028","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-1.529389,-1.605226,0],"type": "door/single swing door","pts":[-1.8832970741785,-1.545226,-1.8832970741785,-1.665226,-1.1754809258215002,-1.665226,-1.1754809258215002,-1.545226]}],"id": "2379","hole_info":[],"type": "Bedroom","floor":[-1.118527,-5.024308,-3.621315,-5.024308,-3.621315,-1.665226,-1.058527,-1.665226,-1.058527,-3.627559,-1.118527,-3.627559],"furniture_info":[],"height":2.8},{"area":2.6524510360920006,"window_info":[{"size":[1.137562792,0.24,1.5000001734],"rotation":[0,0,0],"scale":[0.51698,1,0.995091],"style": "现代","entityId": "8764","to": "","id": "dc0df5cc-e51b-440d-a687-930cedf26440","position":[-0.227512,-3.627559,0.9],"type": "window/window","pts":[-0.796293396,-3.507559,-0.796293396,-3.7475590000000003,0.34126939600000006,-3.7475590000000003,0.341269396,-3.507559],"height":0.9}],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[1.087003542127,0.12,2.099999375],"rotation":[0,0,-180],"scale":[1.132247,1,0.988235],"style": "现代","entityId": "9116","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.227512,-1.605226,0],"type": "door/single swing door","pts":[0.31598977106349996,-1.665226,0.3159897710634999,-1.5452260000000002,-0.7710137710634999,-1.545226,-0.7710137710634999,-1.6652259999999999]}],"id": "3796","hole_info":[],"type": "Balcony","floor":[0.501197,-3.507559,-0.938527,-3.507559,-0.938527,-1.665226,0.501197,-1.665226],"furniture_info":[],"height":2.8},{"area":3.144899696478001,"window_info":[{"size":[0.455024883136,0.24,1.199999783456],"rotation":[0,0,90],"scale":[1.669424,1,1.599812],"style": "复古怀旧","entityId": "8676","to": "","id": "5f203a10-a315-415c-994b-9e85e4346e13","position":[-2.679591,4.246898,0.9],"type": "window/window","pts":[-2.5595909999999997,4.474410441568,-2.799591,4.474410441568,-2.799591,4.019385558432,-2.5595909999999997,4.019385558432],"height":0.9}],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.6323204441989999,0.12,2.099999375],"rotation":[0,0,-90],"scale":[0.658639,1,0.988235],"style": "现代","entityId": "9292","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.60038,3.77925,0],"type": "door/single swing door","pts":[-0.6603800000000001,3.4630897779005,-0.5403800000000001,3.4630897779005005,-0.54038,4.095410222099501,-0.66038,4.0954102220995]}],"id": "4702","hole_info":[],"type": "Bathroom","floor":[-0.66038,3.36841,-2.559591,3.36841,-2.559591,5.024308,-0.66038,5.024308],"furniture_info":[],"height":2.8},{"area":2.05239265065,"window_info":[],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.7335116457219999,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.764042,1,0.988235],"style": "现代","entityId": "9468","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.60038,2.692216,0],"type": "door/single swing door","pts":[-0.5403800000000001,3.0589718228610003,-0.6603800000000001,3.0589718228610003,-0.66038,2.325460177139,-0.54038,2.325460177139]},{"size":[0.760860333689,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.792529,1,0.988235],"style": "现代","entityId": "9556","to": "Kitchen-6543","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-1.89383,2.326713,0],"type": "door/single swing door","pts":[-1.8338299999999998,2.7071431668445,-1.95383,2.7071431668445,-1.95383,1.9462828331554998,-1.8338299999999998,1.9462828331554998]},{"size":[0.395871654332,0.24,2.0999990585600004],"rotation":[0,0,90],"scale":[0.485548,1,1.070576],"style": "欧式/古典","entityId": "9644","to": "Kitchen-6543","id": "276cc863-47d8-4db8-8723-f626a04d1e8c","position":[-1.89383,1.742239,0],"type": "door/entry/single swing door","pts":[-1.77383,1.940174827166,-2.01383,1.940174827166,-2.0138299999999996,1.5443031728340002,-1.7738299999999998,1.5443031728340002]}],"id": "5673","hole_info":[],"type": "Kitchen","floor":[-0.66038,1.475633,-1.77383,1.475633,-1.77383,1.940175,-1.83383,1.940175,-1.83383,3.24841,-0.66038,3.24841],"furniture_info":[],"height":2.8},{"area":2.839067823717999,"window_info":[{"size":[0.281522360988,0.24,1.199999783456],"rotation":[0,0,-180],"scale":[1.032867,1,1.599812],"style": "复古怀旧","entityId": "8852","to": "","id": "5f203a10-a315-415c-994b-9e85e4346e13","position":[-3.260381,3.30841,0.9],"type": "window/window","pts":[-3.119619819506,3.1884099999999997,-3.119619819506,3.42841,-3.4011421804940003,3.42841,-3.4011421804940003,3.1884099999999997],"height":0.9}],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.391913329137,0.24,2.0999990585600004],"rotation":[0,0,-75.233741],"scale":[0.480693,1,1.070576],"style": "欧式/古典","entityId": "9380","to": "Kitchen-5673","id": "276cc863-47d8-4db8-8723-f626a04d1e8c","position":[-1.945964,1.742383,0],"type": "door/entry/single swing door","pts":[-2.111945559392197,1.5834832318109113,-1.879871883200586,1.522312905516937,-1.779982440607803,1.9012827681890887,-2.012056116799414,1.962453094483063]},{"size":[0.760860333689,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.792529,1,0.988235],"style": "现代","entityId": "9556","to": "Kitchen-5673","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-1.89383,2.326713,0],"type": "door/single swing door","pts":[-1.8338299999999998,2.7071431668445,-1.95383,2.7071431668445,-1.95383,1.9462828331554998,-1.8338299999999998,1.9462828331554998]}],"id": "6543","hole_info":[],"type": "Kitchen","floor":[-2.140096,1.476686,-3.621315,1.476686,-3.621315,3.18841,-2.679591,3.18841,-2.679591,3.24841,-1.95383,3.24841,-1.95383,1.94795,-2.013829,1.955724],"furniture_info":[],"height":2.8},{"area":10.667079386005502,"window_info":[],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.7078161483569999,0.12,2.099999375],"rotation":[0,0,0],"scale":[0.737277,1,0.988235],"style": "现代","entityId": "9028","to": "Bedroom-2379","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-1.529389,-1.605226,0],"type": "door/single swing door","pts":[-1.8832970741785,-1.545226,-1.8832970741785,-1.665226,-1.1754809258215002,-1.665226,-1.1754809258215002,-1.545226]},{"size":[1.087003542127,0.12,2.099999375],"rotation":[0,0,-180],"scale":[1.132247,1,0.988235],"style": "现代","entityId": "9116","to": "Balcony-3796","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.227512,-1.605226,0],"type": "door/single swing door","pts":[0.31598977106349996,-1.665226,0.3159897710634999,-1.5452260000000002,-0.7710137710634999,-1.545226,-0.7710137710634999,-1.6652259999999999]},{"size":[0.7091064434609999,0.12,2.099999375],"rotation":[0,0,-90],"scale":[0.738621,1,0.988235],"style": "现代","entityId": "9204","to": "Bedroom-1351","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[0.561197,-0.985823,0],"type": "door/single swingdoor","pts":[0.5011969999999999,-1.3403762217305,0.6211969999999999,-1.3403762217305,0.621197,-0.6312697782695,0.501197,-0.6312697782695]},{"size":[0.7330956863670001,0.24,2.0999990585600004],"rotation":[0,0,-180],"scale":[0.899163,1,1.070576],"style": "欧式/古典","entityId": "9732","to": "","id": "276cc863-47d8-4db8-8723-f626a04d1e8c","position":[0,5.144308,0],"type": "door/entry/single swing door","pts":[0.36654784318350003,5.0243079999999996,0.36654784318350003,5.264308,-0.36654784318350003,5.264308,-0.36654784318350003,5.0243079999999996]},{"size":[0.6323204441989999,0.12,2.099999375],"rotation":[0,0,-90],"scale":[0.658639,1,0.988235],"style": "现代","entityId": "9292","to": "Bathroom-4702","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.60038,3.77925,0],"type": "door/single swing door","pts":[-0.6603800000000001,3.4630897779005,-0.5403800000000001,3.4630897779005005,-0.54038,4.095410222099501,-0.66038,4.0954102220995]},{"size":[0.7335116457219999,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.764042,1,0.988235],"style": "现代","entityId": "9468","to": "Kitchen-5673","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-0.60038,2.692216,0],"type": "door/single swing door","pts":[-0.5403800000000001,3.0589718228610003,-0.6603800000000001,3.0589718228610003,-0.66038,2.325460177139,-0.54038,2.325460177139]},{"size":[0.7596084402249998,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.791225,1,0.988235],"style": "现代","entityId": "8940","to": "Library-8115","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-2.031812,0.833948,0],"type": "door/single swing door","pts":[-1.971812,1.2137522201125,-2.091812,1.2137522201125,-2.091812,0.4541437798875001,-1.971812,0.4541437798875001]}],"id": "7365","hole_info":[],"type": "LivingRoom","floor":[0.501197,-1.545226,-1.971812,-1.545226,-1.971812,1.356226,-1.894069,1.355633,-0.54038,1.355633,-0.54038,5.024308,0.441197,5.024308,0.441197,-0.442385,0.501197,-0.442385],"furniture_info":[],"height":2.8},{"area":4.438483109736,"window_info":[],"decorate_info":[],"baywindow_info":[],"door_info":[{"size":[0.7596084402249998,0.12,2.099999375],"rotation":[0,0,90],"scale":[0.791225,1,0.988235],"style": "现代","entityId": "8940","to": "LivingRoom-7365","id": "9431468d-27b8-409e-b804-3b6a1f39e4ea","position":[-2.031812,0.833948,0],"type": "door/single swing door","pts":[-1.971812,1.2137522201125,-2.091812,1.2137522201125,-2.091812,0.4541437798875001,-1.971812,0.4541437798875001]}],"id": "8115","hole_info":[],"type": "Library","floor":[-2.091812,-1.545226,-3.621315,-1.545226,-3.621315,1.356686,-2.091812,1.356686],"furniture_info":[],"height":2.8}],"height":2.8},
    "sample_house_json_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/b95230b2-e091-420b-b941-fc3270b279ad/v12342423/templateData.json",
    "layout_mode":0,
    "requestId": "9b733aff-be01-4e2f-a7cc-ef3156a0844a",
    "scheme_mode": "frame layout propose output scene"}
smart_decoration_input_transfer_test_01 = {
    "house_id": "106de6d4-1909-4d99-9c73-e3ef06b567d6", "room_id": "",
    "house_data": "", "room_data": "",
    "sample_house_id": "3b4d5d1c-476a-4dd6-9625-be05440a34f6",
    "layout_mode":0,
    "requestId": "195d7611-2f65-449d-9b2e-16e1dc9ea8db",
    "scheme_mode": "frame layout propose output scene"
}
smart_decoration_input_transfer_test_02 = {
    "house_id": "53652d1f-ec13-4dbd-abe8-bf7c2f897fa9", "room_id": "",
    "house_data": "", "room_data": "",
    "layout_number": 1, "propose_number": 1,
    "sample_house": "53652d1f-ec13-4dbd-abe8-bf7c2f897fa9", "sample_room": "",
    "data_idx": "", "data_url": "", "scene_url": "", "image_url": "", "layout_mode": 0,
    "requestId": "195d7611-2f65-449d-9b2e-16e1dc9ea8db",
    "scheme_mode": "frame layout propose output scene"
}
smart_decoration_input_transfer_test_03 = {
    "house_id": "e7d89478-df38-4d19-a69c-b7518a977b3b", "room_id": "",
    "house_data": "", "room_data": "",
    "layout_number": 1, "propose_number": 1,
    "sample_house": "e7d89478-df38-4d19-a69c-b7518a977b3b", "sample_room": "",
    "data_idx": "", "data_url": "", "scene_url": "", "image_url": "", "layout_mode": 0,
    "requestId": "195d7611-2f65-449d-9b2e-16e1dc9ea8db",
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_transfer_test_04 = {
    "house_id": "106de6d4-1909-4d99-9c73-e3ef06b567d6", "room_id": "",
    "house_data": "", "room_data": "",
    "layout_number": 1, "propose_number": 1, "layout_mode": 0,
    "requestId": "195d7611-2f65-449d-9b2e-16e1dc9ea8db",
    "sample_house_id": "ec66a0dd-999e-46dc-875b-6b64135f0039",
    "sample_house_json_url": "",
    "scheme_mode": "frame layout propose output"
}
smart_decoration_input_transfer_test_05 = {
    "house_id": "8728cbe1-9afc-427f-ada4-87d4e39385cf", "room_id": "",
    "house_data": "", "room_data": "",
    "layout_number": 1, "propose_number": 1, "layout_mode": 0,
    "requestId": "195d7611-2f65-449d-9b2e-16e1dc9ea8db",
    "sample_house_id": "f63a947c-1a7a-49eb-9616-f7fd0bb361c4",
    "sample_house_json_url": "",
    "scheme_mode": "frame layout propose output"
}

# 布局算法接口 测试输入:全屋裂变
smart_decoration_input_split_test_91 = {
    "house_id": "73d681a2-4914-4cd3-9c01-2644852d9b8d",
    "house_data": {},
    "design_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/e27e3b92-af2d-425c-8b78-5afb877a6ea8/v1635853692.json",
    "sample_house_id": "cb7d847a-4357-4e92-9d16-6687c679bc19",
    "sample_house_json_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/cb7d847a-4357-4e92-9d16-6687c679bc19/v1635825032/templateData.json",
    "sample_room_id": "",
    "enterprise_id": 2207940390699,
    "enterprise_package": 1931004,
    "layout_mode": 5,
    "scheme_mode": "frame layout propose output scene"
}
smart_decoration_input_split_test_92 = {
    "house_id": "dbc0f4b6-fd6a-4b29-9c77-8d9c45361bad",
    "house_data": {},
    "design_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/e0b27752-4e71-4394-aa25-0c6584484453/v1635928288.json",
    "sample_house_id": "81597cee-6b58-49e5-a666-4b865dc7ed70",
    "sample_house_json_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/81597cee-6b58-49e5-a666-4b865dc7ed70/v1635928211/templateData.json",
    "sample_room_id": "",
    "enterprise_id": 2208884061338,
    "enterprise_package": 1769543,
    "layout_mode": 5,
    "scheme_mode": "frame layout propose output scene"
}
smart_decoration_input_split_test_93 = {
    "house_id": "b5e64b64-000c-45a5-9cec-af38e602929c",
    "house_data": {},
    "design_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/4d572a2b-a898-433e-b351-08b48b8adc85/v1635933231.json",
    "sample_house_id": "74e9131d-7599-4361-b4f5-94fe0013c114",
    "sample_house_json_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/74e9131d-7599-4361-b4f5-94fe0013c114/v1635932363/templateData.json",
    "sample_room_id": "",
    "enterprise_id": 2208884061338,
    "enterprise_package": 1822985,
    "layout_mode": 5,
    "scheme_mode": "frame layout propose output scene"
}

# 布局算法接口 测试输入:全屋漫游 多层房间
smart_decoration_input_wander_test_99 = {
    "house_data": {},
    "house_id": "43c0c7e0-1593-4564-9e89-4dca7930eb34",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/072aebc3-31dc-1146-f41f-314a632763e0_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
# 布局算法接口 测试输入:全屋漫游 问题修复
smart_decoration_input_wander_test_90 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/27d34058-4443-d927-f97f-f5c3182e4760_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_91 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/9ffda566-0c1e-a26d-40ab-61666f31879d_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_92 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/1152c00c-7a7d-8e89-d8cf-efe6f5585cf7_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_93 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/71b91652-de65-a4ad-f39b-cc05696ed46b_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_94 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/9ffda566-0c1e-a26d-40ab-61666f31879d_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_95 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/8dee54b0-fed0-c5cc-9b21-fb0d94b2062f_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_96 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/6ad6ce35-e40d-6051-2ff1-14d124a9914c_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_97 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/40b1a369-a2f7-0d25-20d1-21aa3fe3c5c0_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_98 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/c6c17e58-0b45-c1a4-127d-85c51f931483_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_99 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/0e04839a-fd00-7800-c460-2c66785bf360_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}
smart_decoration_input_wander_test_99 = {
    "house_data": {},
    "house_id": "",
    "data_url": "https://ezhome-prod-temp-assets.cn-beijing.oss.aliyuncs.com/roamingCamera/cf6d6bbf-1871-16ae-1b57-c45e55cca04d_houseData.json",
    "design_url": "",
    "layout_mode": 30,
    "scheme_mode": "frame layout output single"
}


# 布局算法接口 业务场景:我的家  ##################
pass
# 布局算法接口 测试输入:内容迁移
smart_decoration_input_scene_test_10 = {
    "house_id": "8e8cf50c-8634-43f5-bc82-e4ad27b957fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/source_url/fab80a4b-b335-4a95-8deb-a7b6e9368625.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_11 = {
    "house_id": "8e8cf50c-8634-43f5-bc82-e4ad27b957fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/d457cb32-41c0-7763-81e2-4e7a4a0b7bfb_scene_1611727233755.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_12 = {
    "house_id": "8e8cf50c-8634-43f5-bc82-e4ad27b957fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/77f9340c-9f3e-069f-c9e5-de520bf0d0b9_scene_1612411321818.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_13 = {
    "house_id": "8e8cf50c-8634-43f5-bc82-e4ad27b957fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/render_data/fcea3a21-b3af-34a1-f2a7-89101a5d57f4_scene_1606544071626.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_14 = {
    "house_id": "8e8cf50c-8634-43f5-bc82-e4ad27b957fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/render_data/b4211cc8-d351-8bbd-1ba0-1bc9d5988c13_scene_1600257839059.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_15 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/source_url/fab80a4b-b335-4a95-8deb-a7b6e9368625.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_16 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/d457cb32-41c0-7763-81e2-4e7a4a0b7bfb_scene_1611727233755.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_17 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/77f9340c-9f3e-069f-c9e5-de520bf0d0b9_scene_1612411321818.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_18 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/render_data/fcea3a21-b3af-34a1-f2a7-89101a5d57f4_scene_1606544071626.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
smart_decoration_input_scene_test_19 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "house_data": {},
    "room_data": {},
    "sample_scene_list": [
        "https://ossgw.alicdn.com/homeai-inner/material/render_data/b4211cc8-d351-8bbd-1ba0-1bc9d5988c13_scene_1600257839059.json"
    ],
    "layout_mode": 2,
    "scheme_mode": "frame output layout sphere"
}
# 布局算法接口 测试输入:全屋场景
smart_decoration_input_scene_test_20 = {
    "house_id": "db312f64-6013-4761-9460-ce18fd7c0538", "room_id": "",
    "community": "滨湖天地",
    "design_url": "",
    "sample_house_id": "", "sample_room_id": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame layout output sphere"
}
smart_decoration_input_scene_test_21 = {
    "house_id": "fe6fd6f7-cd8d-462a-bf2f-918444f9c796", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_22 = {
    "house_id": "a57ecd5e-6be3-46f9-8a5c-29b132c1ac6c", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_23 = {
    "house_id": "e3277086-1db1-4d23-a1fc-9c9ead6217a6", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_24 = {
    "house_id": "7d1b2560-e926-4674-91e4-2199df910aa8", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_25 = {
    "house_id": "e1d818ad-2ceb-4ad6-b348-f6c6837c05b7", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_26 = {
    "house_id": "3f25fea2-d7ba-45f6-a73e-e10a1fc1c75c", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_27 = {
    "house_id": "c5059b3f-6393-4356-94ef-ac48331fc2fa", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_28 = {
    "house_id": "2f4c7227-2911-4e57-9db4-d0d8b13c6220", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_29 = {
    "house_id": "3db0e3be-70e9-4670-9b30-2d04739b744d", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
# 布局算法接口 测试输入:全屋场景
smart_decoration_input_scene_test_30 = {
    "house_id": "d9896443-1447-4467-b445-6d034a5bf6b9", "room_id": "",
    "design_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/d61b2852-88cc-4658-9e8e-1e2ad64e49c9/v1588180736.json",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_31 = {
    "house_id": "d99499ca-8128-412b-aeb8-6fd3b3ff89d0", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_32 = {
    "house_id": "9c43f28d-6d82-4de8-8d06-fd1cb9c1cdff", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 5,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_33 = {
    "house_id": "e1d818ad-2ceb-4ad6-b348-f6c6837c05b7", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_34 = {
    "house_id": "6d3a3607-1c41-4325-a6b3-41d13d016d06", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_35 = {
    "house_id": "fef31a43-5e31-44d6-99e5-8565c8ba3c17", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_36 = {
    "house_id": "c5059b3f-6393-4356-94ef-ac48331fc2fa", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_37 = {
    "house_id": "2f4c7227-2911-4e57-9db4-d0d8b13c6220", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_38 = {
    "house_id": "440cbe0b-51d6-4d4f-91ba-19742b904911", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
smart_decoration_input_scene_test_39 = {
    "house_id": "685a724d-a46d-44ad-a60c-c81dd0dd5cf4", "room_id": "",
    "design_url": "",
    "layout_mode": 2,
    "layout_time": 15,
    "layout_number": 3,
    "scheme_mode": "frame output sphere"
}
# 布局算法接口 测试输入:全屋场景
smart_decoration_input_scene_test_40 = {
    "house_id": "0af5f065-dc78-424a-8da5-2d5e060c2eac", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_41 = {
    "house_id": "b9d1bfc9-e39a-4753-b326-b888c9519567", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_42 = {
    "house_id": "b841eb60-d776-40d7-9094-40e4c8a99df5", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_43 = {
    "house_id": "e0dc5270-ee9c-41a2-9923-6056ece81f84", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_44 = {
    "house_id": "6d3a3607-1c41-4325-a6b3-41d13d016d06", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_45 = {
    "house_id": "fef31a43-5e31-44d6-99e5-8565c8ba3c17", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_46 = {
    "house_id": "c5059b3f-6393-4356-94ef-ac48331fc2fa", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_47 = {
    "house_id": "2f4c7227-2911-4e57-9db4-d0d8b13c6220", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_48 = {
    "house_id": "440cbe0b-51d6-4d4f-91ba-19742b904911", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample sphere"
}
smart_decoration_input_scene_test_49 = {
    "house_id": "151aa01a-5c23-4466-84b7-996642363d93", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 2,
    "scheme_mode": "frame output layout sample rsphere"
}

# 布局算法接口 测试输入:测试问题 TODO:卓阔
smart_decoration_input_scene_test_99 = {
    "house_id": "9ec5a3d4-0bef-4a15-a08f-8af427fad22b",
    "community": "",
    "sample_house_id": "520b0072-72cc-4774-85d9-2404d474539e", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "2cd34005-af19-4a60-a83b-e3ec9c5a6fd3",
    "community": "滨湖天地",
    "sample_house_id": "520b0072-72cc-4774-85d9-2404d474539e", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "980c0677-f0a0-4aa5-ba9f-8aad3433ce5b",
    "community": "滨湖天地",
    "sample_house_id": "520b0072-72cc-4774-85d9-2404d474539e", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "a57ecd5e-6be3-46f9-8a5c-29b132c1ac6c",
    "community": "滨湖天地",
    "sample_house_id": "520b0072-72cc-4774-85d9-2404d474539e", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "e3277086-1db1-4d23-a1fc-9c9ead6217a6",
    "community": "滨湖天地",
    "sample_house_id": "520b0072-72cc-4774-85d9-2404d474539e", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "74140259-d7fb-4eb1-9d94-6aff0cfdd4a2",
    "design_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/design/2021-08-04/json/16006498-cfaf-43b1-8a85-bd3831cf60ae.json",
    "community": "",
    "sample_house_id": "", "sample_room_id": "",
    "layout_number": 4,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}
smart_decoration_input_scene_test_99 = {
    "house_id": "fd85fc24-7a91-422a-b553-636945759649",
    "community": "",
    "sample_house_id": "", "sample_room_id": "",
    "house_replace": {},
    "layout_number": 3,
    "layout_mode": 2,
    "style_mode": "all",  # all random contemporary
    "struct_mode": "no_ceiling",
    "scheme_mode": "frame sphere output layout"
}


# 布局算法接口 测试输入:全屋参考
smart_decoration_input_advice_test_99 = {
    "house_id": "b4767708-23b3-4325-a6b1-f8b525f29e8e", "room_id": "",
    "house_data": {},
    "room_data": {},
    "layout_mode": 4,
    "scheme_mode": "frame output"
}
# 布局算法接口 测试输入:全屋参考 包围盒
smart_decoration_input_advice_test_00 = {
    "house_id": "", "room_id": "",
    "house_data": {},
    "room_data": {},
    "room_scene": {
        "id": "863967",
        "type": "sofa",
        "aabb": (-1.4808699853515626, 11.303105764014386, 1.4808719995117183, 12.249791002502443),
        "height": 0.808918991,
        "camera": {
            "aspect": 1.0, "fov": 34.537989, "near": 0.15000000000000002, "far": 1000,
            "up": [0, 1, 0],
            "pos": [2.937417, 1.000291, 15.473217],
            "target": [2.366777, 0.9953844451838773, 14.854133]
        },
        "normal": [0, 0, 1]
    },
    "layout_mode": 4,
    "scheme_mode": "output"
}
# 布局算法接口 测试输入:全屋参考 小场景
smart_decoration_input_advice_test_01 = {
    "house_id": "", "room_id": "",
    "house_data": {},
    "room_data": {},
    "room_scene": {},
    "room_scene_url": "http://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/fc874dcc-ae82-4fd3-a49c-71abc110871a/1584799853848/scene.json",
    "layout_mode": 4,
    "scheme_mode": "output"
}
# 布局算法接口 测试输入:全屋参考 样板间
smart_decoration_input_advice_test_02 = {
    "sample_house_json": {},
    "sample_house_json_url": "https://ihome-alg-layout.oss-cn-hangzhou.aliyuncs.com/sample_data/sample_test_03.json",
    "layout_mode": 4,
    "scheme_mode": "output"
}
smart_decoration_input_advice_test_03 = {
    "sample_house_id": "ef006923-8721-4100-b011-88f84e3bec71",
    "layout_mode": 4,
    "scheme_mode": "output"
}

# 布局算法接口 测试输入:全屋分析
smart_decoration_input_analyze_test_91 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/1df3ec2f-091c-4fa5-21be-66f3b8d32cb6_scene_1600500564168.json",
    "house_item": [
        {"id": "1de06ba8-ca37-40ff-8e97-c8698535fbda","item_id":655307401310,"material_id":79157780,"room_id": "42271","room_type": "LivingRoom","sku_id":4727552164972}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_92 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/1005ae52-2ef3-d80b-c521-2b3a39263cdd_scene_1628855499411.json",
    "house_item": [
        {"id": "78c2204a-60e1-42f4-8379-88081daec7a4","item_id":655307401310,"material_id":79157780,"room_id": "155708","room_type": "LivingRoom","sku_id":4727552164972}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_93 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/5942bfe2-abaf-e527-3c27-9a24cea9c36c_scene_1619786222071.json",
    "house_item": [
        {"id": "42308290-1cad-429f-8c4b-23c9cc652cdb","item_id":655307401310,"material_id":79157780,"room_id": "90116","room_type": "LivingRoom","sku_id":4727552164972}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_94 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/8c2b4d26-d049-e375-a44b-2146ddbf8085_scene_1600499514586.json",
    "house_item": [
        {"id": "d4d36a39-4bad-4785-85be-65258bc78eef","item_id":655307401310,"material_id":79157780,"room_id": "DiningRoom","room_type": "LivingRoom","sku_id":4727552164972}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_95 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/DesignAdmin_116266541.json",
    "house_item": [{"id": "70106dc1-c70a-4428-a473-863ee3907ac8","item_id":550019639401,"material_id":414964219,"room_id": "12196","room_type": "客餐厅","sku_id":3926796884294}],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_96 = {
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/DesignAdmin_116277603.json",
    "house_item": [{"id": "75ece63d-6267-4b10-bdb2-87c4e7812f82","item_id":631953396135,"material_id":415026195,"room_id": "255004","room_type": "客餐厅1","sku_id":4686777143706}],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_97 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/54bcdf07-a6ee-818f-33d1-1b6c76b6c961_scene_1632796986313.json",
    "house_item": [
        {"id": "3409b794-7573-437d-8372-91f89c51afcb","item_id":641516844687,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4907562527284},
        {"id": "079ea463-8de0-4190-9f3d-c66766b0c895","item_id":626960392962,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4885323787369},
        {"id": "36575849-3e24-4a16-a49a-9148d4044389","item_id":626249804035,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4781895726421},
        {"id": "030dccbd-8c9c-4447-8004-641b4154c731","item_id":640822450234,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4733917885889},
        {"id": "166ef9c1-3029-4a5c-aa78-d6c4bef90d9e","item_id":624678207349,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4902743646302},
        {"id": "182ffc24-01fa-406f-9ac2-7fce90a6dc55","item_id":638667889596,"material_id":80096748,"room_id": "198576","room_type": "客餐厅","sku_id":4647816053530}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_98 = {
    "house_id": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/6510ac29-16cb-6f75-5087-4e617a9a23b6_scene_1602728702662.json",
    "house_item": [
        {"content_id":45205161213,"id": "41b3639c-0adf-4883-b025-709e19de5625","item_id":617063979577,"material_id":8861412,"room_id": "1516","room_type": "客厅","sku_id":4550335849796},
        {"content_id":50605351213,"id": "832d413e-31dc-425e-bae9-25e4554d3fee","item_id":600444772409,"material_id":8861412,"room_id": "1516","room_type": "客厅","sku_id":4540561832174},
        {"content_id":62365821213,"id": "3a65a347-0d58-4f7e-9430-5a5826aafbdc","item_id":627152171990,"material_id":8861414,"room_id": "3993","room_type": "卧室","sku_id":4717347447027},
        {"content_id":18509501213,"id": "f862bbf9-7208-47e1-854d-a0464b631733","item_id":546167924938,"material_id":8861414,"room_id": "3993","room_type": "卧室","sku_id":4713193230263},
        {"content_id":62765651213,"id": "aa756596-b4e4-4dc1-be4a-423f5a53ef82","item_id":573801252821,"material_id":8861410,"room_id": "2576","room_type": "卧室","sku_id":4367091976674},
        {"content_id":61221351213,"id": "4b02cee1-78b4-45ee-95c1-89b2f8d5c104","item_id":562007727755,"material_id":8861410,"room_id": "2576","room_type": "卧室","sku_id":3773669395143}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame"
}
smart_decoration_input_analyze_test_99 = {
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/f94b79ac-7403-6f5e-872a-ace5ff04ee9c_scene_1619780692604.json",
    "house_item": [
        {"id":"5fe044ab-9085-415b-9a82-d5ab80a97d5d","item_id":641655046201,"material_id":30157029,"room_id":"12118","room_type":"阳台1","sku_id":4795849383574}
    ],
    "layout_mode": 30,
    "scheme_mode": "board output frame frame"
}

# 布局算法接口 业务场景:放我家  ##################
pass
# 装修布局接口 测试输入:铺贴替换 单批测试
smart_decoration_input_paint_test_99 = {
    "house_id": "f148603d-f0c3-4df5-9a54-53611f058314",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/smarthome/bd0a54d5195b98db9a7b7a06bc322b18/scene.json",
    "house_replace": {
        "LivingRoom-8536": {"floor": ["6a42686b-3d11-4174-bdd3-b76425c7f68e"]}
    },
    "scheme_mode": "renderMode"
}
smart_decoration_input_paint_test_98 = {
    "house_id": "f9646e00-3a6e-47b4-b7c3-1a15601ad77d",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/f9646e00-3a6e-47b4-b7c3-1a15601ad77d/v1632323417/scene.json",
    "house_replace": {
        "LivingDiningRoom-2445": {
            "floor": {"1de11bce-e56b-48ab-8eb7-9185a9fe82dc": "c9a7f059-46dc-4ed6-b799-68e1f05d2095"},
            "wall": {"e00a2280-5ca8-4564-915c-26dd81f321b7": "600e8d9a-83c0-4b85-a1bb-c12b7fc56a13"}
        },
        # "Bedroom-5818": {
        #     "floor": {"1de11bce-e56b-48ab-8eb7-9185a9fe82dc": "c9a7f059-46dc-4ed6-b799-68e1f05d2095"},
        #     "wall": {"77012b94-5aaa-4e65-b3f6-7fc7e629892f": "600e8d9a-83c0-4b85-a1bb-c12b7fc56a13"}
        # },
        # "Balcony-5720": {
        #     "wall": ["274b9e4f-5f6c-4089-98f7-af1e4661547b"],
        #     "floor": ["e20746cb-ad6b-4659-9384-07dafcdb70d0"]
        #     },
        # "MasterBedroom-14060": {
        #     "wall": ["274b9e4f-5f6c-4089-98f7-af1e4661547b"],
        #     "floor": ["44d6fc60-53d8-444e-a5e2-ab1fa58876a9"]
        # }

    },
    "render_mode": "decorate original result",
    "scheme_mode": "frame output scene render"
}

# 组合布局接口 测试输入:软装替换 单批测试
smart_decoration_input_soft_test_91 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/0037cc41-337e-4583-b9cb-f294b772b9e6/v1607147067/scene.json",
    "house_replace": {
        "LivingDiningRoom-9037": {
            "soft": ["b6b44b3e-1203-4572-824a-b8c36ab197b4"],
            "wall": ["274b9e4f-5f6c-4089-98f7-af1e4661547b"],
            "floor": ["6a42686b-3d11-4174-bdd3-b76425c7f68e"],
        }
    },
    "layout_mode": 11,
    "render_mode": "",
    "scheme_mode": "frame output scene"
}
smart_decoration_input_soft_test_92 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/0037cc41-337e-4583-b9cb-f294b772b9e6/v1607147067/scene.json",
    "house_replace": {
        "LivingDiningRoom-9037": {
            "soft": ["bb96ef81-df96-4703-ac40-eb0caa086e62"],
            "wall": ["274b9e4f-5f6c-4089-98f7-af1e4661547b"],
            "floor": ["6a42686b-3d11-4174-bdd3-b76425c7f68e"],
        }
    },
    "layout_mode": 11,
    "render_mode": "",
    "scheme_mode": "frame output scene"
}
smart_decoration_input_soft_test_99 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/0037cc41-337e-4583-b9cb-f294b772b9e6/v1607147067/scene.json",
    "house_replace": {
        "LivingDiningRoom-9037": {
            "soft": ["b6b44b3e-1203-4572-824a-b8c36ab197b4"],
            "wall": ["274b9e4f-5f6c-4089-98f7-af1e4661547b"],
            "floor": ["6a42686b-3d11-4174-bdd3-b76425c7f68e"],
        }
    },
    "layout_mode": 11,
    "render_mode": "",
    "scheme_mode": "frame output scene"
}
# 装修布局接口 测试输入:铺贴用量 单批测试
smart_decoration_input_pave_test_99 = {
    "house_id": "52368adc-ea49-4129-aea2-2b96e0d2f432",
    "house_material": {
        "Bedroom-3113": {
            "floor": {"jid": "ecfb5638-302e-4453-8b31-aa887d8d5a86", "price": 67.0}},
        "LivingDiningRoom-9114": {
            "floor": {"jid": "ecfb5638-302e-4453-8b31-aa887d8d5a86",
                      "price": 67.0}}
    }
}


# 布局算法接口 业务场景:数字家  ##################
pass
# 组合布局接口 测试输入:组合提取 联合柜体
smart_decoration_input_group_test_99 = {
    "house_id": "7290b461-946c-49e1-9291-77d61cd0cd0f", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame layout group output"
}
# 组合布局接口 测试输入:组合提取 流行趋势
smart_decoration_input_group_test_99 = {
    "house_id": "520b0072-72cc-4774-85d9-2404d474539e", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame layout group output"
}
# 组合布局接口 测试输入:组合提取 设计还原
smart_decoration_input_group_test_99 = {
    "house_id": "419799a0-29fb-4da2-8e27-206c1f460bc1", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group object"
}
# 组合布局接口 测试输入:组合提取 套餐方案
smart_decoration_input_group_test_81 = {
    "house_id": "3ee22a2f-3120-4d8e-84df-f2da88142d2e", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
# 组合布局接口 测试输入:组合提取 评价弹幕
smart_decoration_input_group_test_91 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/1df3ec2f-091c-4fa5-21be-66f3b8d32cb6_scene_1600500564168.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_92 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/1005ae52-2ef3-d80b-c521-2b3a39263cdd_scene_1628855499411.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_93 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/5942bfe2-abaf-e527-3c27-9a24cea9c36c_scene_1619786222071.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_94 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/8c2b4d26-d049-e375-a44b-2146ddbf8085_scene_1600499514586.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_95 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/7005653f-88b8-cea5-20fd-92c80ebf04f0_scene_1602722886854.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_96 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/0b8e0498-a397-2171-eb85-d23c37b5c672_scene_1634023154933.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_97 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/54bcdf07-a6ee-818f-33d1-1b6c76b6c961_scene_1632796986313.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_98 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/render_data/6510ac29-16cb-6f75-5087-4e617a9a23b6_scene_1602728702662.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
smart_decoration_input_group_test_99 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://ossgw.alicdn.com/homeai-inner/material/barrgan_render_data/5c4af037-b3c6-fc1e-309f-05a688298acd_scene_1622790767084.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
# 组合布局接口 测试输入:组合提取 日常测试
smart_decoration_input_group_test_99 = {
    "house_id": "483523d0-fe11-491e-b58c-5b09303c35d8", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame group"
}
# 组合布局接口 测试输入:组合提取 演示方案
smart_decoration_input_group_test_01 = {
    "house_id": "466cb1f8-65af-4c2e-aee4-7c0f4f7ac01a", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/466cb1f8-65af-4c2e-aee4-7c0f4f7ac01a/v1626349286/scene.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame layout group output"
}
smart_decoration_input_group_test_02 = {
    "house_id": "bcbc9272-b0f5-4a2e-a5a5-0d3ba2740fb1", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/bcbc9272-b0f5-4a2e-a5a5-0d3ba2740fb1/v1626232183/scene.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame layout group output"
}
smart_decoration_input_group_test_03 = {
    "house_id": "4e57fe1b-d53b-4257-a88e-ad4388f9d455", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/4e57fe1b-d53b-4257-a88e-ad4388f9d455/v1626232265/scene.json",
    "design_url": "",
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "scheme_mode": "frame layout group output"
}

# 组合布局接口 测试输入:组合配饰 单批测试
smart_decoration_input_adorn_test_99 = {
    "house_id": "f448278c-9b14-4fde-8cfe-df93832244c3",
    "room_id": "Bedroom-516",
    "plat_id": "4f691e78-4740-40c7-8069-39f9de007d5e",
    "house_data": {},
    "room_data": {
        "id": "Bedroom-516",
        "type": "Bedroom",
        "style": "country",
        "area": 23.422513628412,
        "furniture_info": [
            {
                "id": "4f691e78-4740-40c7-8069-39f9de007d5e",
                "type": "table/dining table - square",
                "style": "北欧",
                "size": [2.1343199999999998, 0.821148, 0.727572],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group output"
}
smart_decoration_input_adorn_test_99 = {
    "house_id":"1fc3c93b-d9b8-4079-a897-6eb6c8b86c90",
    "room_id":"Bedroom-1241",
    "plat_id":"ae135459-299f-46d5-b0fd-feee01764ef9",
    "plat_entity":"9215",
    "house_data":"{}",
    "room_data":{"id":"Bedroom-1241","type":"Bedroom","style":"emptyStyle","area":11.770871574042,"furniture_info":[{"id":"ae135459-299f-46d5-b0fd-feee01764ef9","type":"window/bay window","style":"现代","size":[0.8540000000000001,1.608,1.6],"scale":[1,1,1],"position":[-3.344372,-1.180364195583598,0.5],"rotation":[0,0,0]}]},
    "layout_number":2,
    "propose_number":3,
    "layout_mode":20,
    "requestId":"b8b71fbf-b43f-4aad-bf26-49b08a3d5473",
    "traceId":"f8299d1e-ac9e-4c26-b11d-9b802792dfb0",
    "scheme_mode": "group output"
}
# 00 单人沙发 01 多人沙发 02 拐角沙发 03 飘窗 04 床
smart_decoration_input_adorn_test_00 = {
    "house_id": "bbeeba6e-8851-4d92-bc01-af7eedc1c011",
    "room_id": "none-516",
    "plat_id": "abd99c3d-1917-44ec-9f96-e86ed474109a",
    "plat_entity": "1668",
    "house_data": "{}",
    "room_data": {
        "id": "none-516",
        "type": "none",
        "style": "",
        "area": 96.487295951696,
        "furniture_info": [
            {
                "id": "abd99c3d-1917-44ec-9f96-e86ed474109a",
                "type": "sofa/single seat sofa",
                "style": "现代",
                "size": [1.1405500000000002, 1.13724, 0.884491],
                "scale": [1, 1, 1],
                "position": [
                    -3.970311710598315,
                    7.271401639424644,
                    6.418425163629746e-16
                ],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "fdfd3e02-2340-4b94-8f99-ae0547dcd907",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_00 = {
    "house_id": "bbeeba6e-8851-4d92-bc01-af7eedc1c011",
    "room_id": "none-516",
    "plat_id": "dde9f967-8724-4998-a813-01d9eea1db6c",
    "plat_entity": "1668",
    "house_data": "{}",
    "room_data": {
        "id": "none-516",
        "type": "none",
        "style": "",
        "area": 96.487295951696,
        "furniture_info": [
            {
                "id": "dde9f967-8724-4998-a813-01d9eea1db6c",
                "type": "sofa/single seat sofa",
                "style": "现代",
                "size": [1.1405500000000002, 1.13724, 0.884491],
                "scale": [1, 1, 1],
                "position": [
                    -3.970311710598315,
                    7.271401639424644,
                    6.418425163629746e-16
                ],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "fdfd3e02-2340-4b94-8f99-ae0547dcd907",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_01 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "47aa19fa-34fc-44b1-8bdb-da62086daa0b",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "47aa19fa-34fc-44b1-8bdb-da62086daa0b",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_01 = {
    "house_id": "f448278c-9b14-4fde-8cfe-df93832244c3",
    "room_id": "LivingDiningRoom-516",
    "plat_id": "95f863cb-1353-45c5-a623-ca93b8f29a5a",
    "house_data": {},
    "room_data": {
        "id": "Bedroom-516",
        "type": "Bedroom",
        "style": "country",
        "area": 23.422513628412,
        "furniture_info": [
            {
                "id": "95f863cb-1353-45c5-a623-ca93b8f29a5a",
                "type": "table/dining table - square",
                "style": "北欧",
                "size": [2.1343199999999998, 0.821148, 0.727572],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_01_v2 = {
    "house_id": "9e569ecb-f51a-4a42-a168-bf5bbf4b7ab9",
    "room_id": "LivingDiningRoom-3982",
    "plat_id": "5086d9ec-c06c-47db-a750-c7c3a4ac9e25",
    "plat_entity":"8884",
    "house_data": {},
    "room_data": {
        "id": "LivingDiningRoom-3982",
        "type": "LivingDiningRoom",
        "style": "emptyStyle",
        "area": 33.70105624666585,
        "furniture_info": [
            {
                "id": "5086d9ec-c06c-47db-a750-c7c3a4ac9e25",
                "type": "sofa/ multi seat sofa",
                "style": "其他",
                "size": [1.8999912808,0.78074071003,0.79867167709],
                "scale": [0.81899,0.81899,0.81899],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_02 = {
    "house_id": "bbeeba6e-8851-4d92-bc01-af7eedc1c011",
    "room_id": "Auditorium-516",
    "plat_id": "190187da-f385-4f20-9535-bf4645147260",
    "plat_entity": "1669",
    "house_data": "{}",
    "room_data": {
        "id": "Auditorium-516",
        "type": "Auditorium",
        "style": "",
        "area": 96.487295951696,
        "furniture_info": [
            {
                "id": "190187da-f385-4f20-9535-bf4645147260",
                "type": "sofa/type L sofa",
                "style": "现代",
                "size": [2.8187, 1.6584200000000002, 0.7640560000000001],
                "scale": [1, 1, 1],
                "position": [-3.1312367105983134, -1.625285, -5.938079083240678e-16],
                "rotation": [0, 0, 179.99999999999997]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "85aaeda7-1521-4a8d-9a7e-f9e89b500f26",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_03 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "ee4c0d03-517e-4363-91f0-729163b84a88",
    "plat_entity": "6104",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 38.222080437681015,
        "furniture_info": [
            {
                "id": "ee4c0d03-517e-4363-91f0-729163b84a88",
                "type": "parametric corner window",
                "style": "现代",
                "size": [2.1670000000000007, 2.1670000000000007, 1.6],
                "scale": [1, 1, 1],
                "position": [-1.3430158996919248, 2.67188, 0.85],
                "rotation": [0, 0, -180]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "4cf39cd3-50af-4c67-87de-3b4fbe9807cc",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_03 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "277aa3da-8844-4dcc-9df7-678fdb7af7b0",
    "plat_entity": "6104",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 38.222080437681015,
        "furniture_info": [
            {
                "id": "277aa3da-8844-4dcc-9df7-678fdb7af7b0",
                "type": "window/bay window",
                "style": "现代",
                "size": [1.98968, 0.24, 1.37326],
                "scale": [1, 1, 1],
                "position": [9.90466, 10.030587, 0.9],
                "rotation": [0, 0, -180]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "4cf39cd3-50af-4c67-87de-3b4fbe9807cc",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_03 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "ae135459-299f-46d5-b0fd-feee01764ef9",
    "plat_entity": "6104",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 38.222080437681015,
        "furniture_info": [
            {
                "id": "ae135459-299f-46d5-b0fd-feee01764ef9",
                "type": "window/bay window",
                "style": "现代",
                "size": [1.608, 0.8540000000000001, 1.6],
                "scale": [1, 1, 1],
                "position": [-1.3430158996919248, 2.67188, 0.85],
                "rotation": [0, 0, -180]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "4cf39cd3-50af-4c67-87de-3b4fbe9807cc",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_03 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "ae135459-299f-46d5-b0fd-feee01764ef9",
    "plat_entity": "6104",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 38.222080437681015,
        "furniture_info": [
            {
                "id": "ae135459-299f-46d5-b0fd-feee01764ef9",
                "type": "param window/bay window",
                "style": "现代",
                "size": [1.608, 0.8540000000000001, 1.6],
                "scale": [1, 1, 1],
                "position": [-1.3430158996919248, 2.67188, 0.85],
                "rotation": [0, 0, -180]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "4cf39cd3-50af-4c67-87de-3b4fbe9807cc",
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_04 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "39723ccd-98e9-4ba4-85b0-b18fa04310c8",
    "plat_entity": "1670",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 42.259237517559,
        "furniture_info": [
            {
                "id": "39723ccd-98e9-4ba4-85b0-b18fa04310c8",
                "type": "sofa/left corner sofa",
                "style": "现代",
                "size": [2.99546, 2.07137, 0.979803],
                "scale": [1, 1, 1],
                "position": [1.8360799406046255, -0.12097564247195347, -8.959264915843268e-18],
                "rotation": [0, 0, 90]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "requestId": "e5c640df-3ae8-40e1-ba85-fe3d01c529d8",
    "scheme_mode": "group"
}
# 05 茶几/边桌 06 餐桌 07 电视柜 08 书桌/玄关台/吧台/儿童桌椅 09 化妆桌
smart_decoration_input_adorn_test_05 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "888ffe40-ad39-4bee-8c4c-ed03c3369533",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "888ffe40-ad39-4bee-8c4c-ed03c3369533",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_06 = {
    "house_id": "ad6fb4d5-c114-4887-946f-19fe61e38e20",
    "room_id": "LivingDiningRoom-516",
    "plat_id": "a60785ec-56d4-4050-9fce-9f83254ac684",
    "house_data": {},
    "room_data": {
        "id": "LivingDiningRoom-516",
        "type": "LivingDiningRoom",
        "style": "country",
        "area": 23.422513628412,
        "furniture_info": [
            {
                "id": "a60785ec-56d4-4050-9fce-9f83254ac684",
                "type": "table/dining table - square",
                "style": "北欧",
                "size": [2.1343199999999998, 0.821148, 0.727572],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group output"
}
smart_decoration_input_adorn_test_07 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "4ce8dbb4-1da6-4908-b9c7-89623d6a6af3",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "4ce8dbb4-1da6-4908-b9c7-89623d6a6af3",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_07 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "f448278c-9b14-4fde-8cfe-df93832244c3",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "f448278c-9b14-4fde-8cfe-df93832244c3",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_08 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "09f1e2fc-eb93-4173-bc1a-8891374f8b87",
    "plat_entity": "665",
    "house_data": {},
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 25.559627625765998,
        "furniture_info": [
            {
                "id": "09f1e2fc-eb93-4173-bc1a-8891374f8b87",
                "type": "cabinet/hutch&buffet",
                "style": "东南亚",
                "size": [0.45000, 0.37678, 1.84600],
                "scale": [1, 1, 1],
                "position": [1.4813460131675202, 1.996505, 2.739642453947099e-16],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_08 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "99a01dac-43a9-4e6b-b443-9a1c83241b4c",
    "plat_entity": "668",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 42.259237517559,
        "furniture_info": [
            {
                "id": "99a01dac-43a9-4e6b-b443-9a1c83241b4c",
                "type": "table/table",
                "style": "Contemporary",
                "size": [1.3949600219726562, 1.3949600219726562, 0.7123889923095703],
                "scale": [1, 1, 1],
                "position": [2.3829082670151513, 0.6024838146655407, 7.963896593378816e-17],
                "rotation": [
                    0,
                    0,
                    0
                ]
            }
        ]
    },
    "layout_mode": 20,
    "layout_number": 2,
    "propose_number": 3,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_09 = {
    "layout_number": 2,
    "room_id": "undefined-516",
    "propose_number": 3,
    "house_data": {

    },
    "house_id": "",
    "requestId": "71ae7e03-63d5-4115-80ad-ffd1c8d7db55",
    "room_data": {
        "area": 58.15334205074801,
        "style": "",
        "id": "undefined-516",
        "furniture_info": [
            {
                "size": [
                    1.4767599999999999,
                    0.490509,
                    1.33
                ],
                "rotation": [
                    0,
                    0,
                    0
                ],
                "scale": [
                    1,
                    1,
                    1
                ],
                "style": "现代",
                "id": "0d8f14cc-f00b-47d5-952b-76ddecb4b04d",
                "position": [
                    0.18653999999999993,
                    1.135698610095099,
                    6.225536336200275e-17
                ],
                "type": "table/table"
            }
        ],
        "type": "",
        "height": 0
    },
    "plat_id": "0d8f14cc-f00b-47d5-952b-76ddecb4b04d",
    "layout_mode": 20,
    "type": "request",
    "plat_entity": "665"
}
smart_decoration_input_adorn_test_09 = {
    "layout_number": 2,
    "room_id": "undefined-516",
    "propose_number": 3,
    "house_data": {

    },
    "house_id": "",
    "requestId": "71ae7e03-63d5-4115-80ad-ffd1c8d7db55",
    "room_data": {
        "area": 58.15334205074801,
        "style": "",
        "id": "undefined-516",
        "furniture_info": [
            {
                "size": [
                    1.4767599999999999,
                    0.490509,
                    1.33
                ],
                "rotation": [
                    0,
                    0,
                    0
                ],
                "scale": [
                    1,
                    1,
                    1
                ],
                "style": "现代",
                "id": "4f691e78-4740-40c7-8069-39f9de007d5e",
                "position": [
                    0.18653999999999993,
                    1.135698610095099,
                    6.225536336200275e-17
                ],
                "type": "table/table"
            }
        ],
        "type": "",
        "height": 0
    },
    "plat_id": "4f691e78-4740-40c7-8069-39f9de007d5e",
    "layout_mode": 20,
    "type": "request",
    "plat_entity": "665"
}
# 10 玄关柜 11 鞋柜 12 书柜 13 餐边柜 14 浴室柜/洗衣机柜
smart_decoration_input_adorn_test_10 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "8f270a4c-4e5e-42da-919d-4ed248fe2f4b",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "8f270a4c-4e5e-42da-919d-4ed248fe2f4b",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 90]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_10 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "697897fc-c75f-45a6-9ebd-c56d43f78f6c",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "697897fc-c75f-45a6-9ebd-c56d43f78f6c",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 90]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_11 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "331247",
    "plat_entity": "665",
    "house_data": {},
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 25.559627625765998,
        "furniture_info": [
            {
                "id": "331247",
                "type": "cabinet/hutch&buffet",
                "style": "东南亚",
                "size": [0.879996, 0.352662, 1.46984],
                "scale": [1, 1, 1],
                "position": [1.4813460131675202, 1.996505, 2.739642453947099e-16],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_12 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "7f731dba-f177-4f09-ab8c-35570e893b83",
    "plat_entity": "665",
    "house_data": {},
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 25.559627625765998,
        "furniture_info": [
            {
                "id": "7f731dba-f177-4f09-ab8c-35570e893b83",
                "type": "cabinet/hutch&buffet",
                "style": "东南亚",
                "size": [0.45000, 0.37678, 1.84600],
                "scale": [1, 1, 1],
                "position": [1.4813460131675202, 1.996505, 2.739642453947099e-16],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_13 = {
    "house_id": "f448278c-9b14-4fde-8cfe-df93832244c3",
    "room_id": "Bedroom-516",
    "plat_id": "d3fd7520-3c1f-4b9f-a91e-83b00e8f4412",
    "house_data": {},
    "room_data": {
        "id": "Bedroom-516",
        "type": "Bedroom",
        "style": "country",
        "area": 23.422513628412,
        "furniture_info": [
            {
                "id": "d3fd7520-3c1f-4b9f-a91e-83b00e8f4412",
                "type": "cabinet/hutch&buffet",
                "style": "北欧",
                "size": [2.1343199999999998, 0.821148, 0.727572],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_13 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "1e66af21-3107-4151-b960-582fcf281081",
    "plat_entity": "665",
    "house_data": {},
    "room_data": {
        "id": "undefined-516",
        "type": "",
        "style": "",
        "area": 25.559627625765998,
        "furniture_info": [
            {
                "id": "1e66af21-3107-4151-b960-582fcf281081",
                "type": "cabinet/hutch&buffet",
                "style": "东南亚",
                "size": [0.45000, 0.37678, 1.84600],
                "scale": [1, 1, 1],
                "position": [1.4813460131675202, 1.996505, 2.739642453947099e-16],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_14 = {
    "house_id": "",
    "room_id": "undefined-516",
    "plat_id": "612a1a9d-8797-4c6d-9d2f-5ee9718030f8",
    "plat_entity": "838",
    "house_data": "{}",
    "room_data": {
        "id": "undefined-516", "type": "", "style": "", "area": 15.257757472275998,
        "furniture_info": [
            {
                "id": "612a1a9d-8797-4c6d-9d2f-5ee9718030f8",
                "type": "table/table", "style": "现代",
                "size": [1.5, 0.36, 0.9045000000000001], "scale": [1, 1, 1],
                "position": [0.153505213109697, 0.1659249649824983, 3.004472039566197e-17], "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 20,
    "scheme_mode": "group"
}
smart_decoration_input_adorn_test_14 = {
    "house_id": "f448278c-9b14-4fde-8cfe-df93832244c3",
    "room_id": "Bedroom-516",
    "plat_id": "e6cdf559-23ee-4e5d-bc6d-8c40ce5f9d8b",
    "house_data": {},
    "room_data": {
        "id": "Bedroom-516",
        "type": "Bedroom",
        "style": "country",
        "area": 23.422513628412,
        "furniture_info": [
            {
                "id": "e6cdf559-23ee-4e5d-bc6d-8c40ce5f9d8b",
                "type": "cabinet/hutch&buffet",
                "style": "北欧",
                "size": [2.1343199999999998, 0.821148, 0.727572],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            }
        ]
    },
    "layout_number": 2,
    "propose_number": 3,
    "layout_mode": 20,
    "scheme_mode": "group"
}

# 组合布局接口 测试输入:组合内空 单批测试
smart_decoration_input_inner_test_99 = {
    "house_id": '6f9c0675-9fa8-4c68-91b6-8692a00cf1b8',
    "room_id": "Bedroom-516",
    "plat_id": "7f731dba-f177-4f09-ab8c-35570e893b83",
    "room_data": {
        "id": 'none-487',
        "type": 'DiningRoom',
        "style": "country",
        "area": 40.4614,
        "unit": 'cm',
        "furniture_info": [
            {
                "id": "7f731dba-f177-4f09-ab8c-35570e893b83",
                "type": "cabinet/floor-based cabinet",
                "style": "Contemporary",
                "size": [3.07624, 0.425001, 2.28983],
                "scale": [1, 1, 1],
                "position": [-0.279159, 0.781711, 0],
                "rotation": [0, 0, 0]
            },
            {'id': 'fd404388-d448-4b98-bcae-01589a6344b9', 'type': 'cabinet/floor-based cabinet', 'style': 'Chinese Modern', 'size': [68.2017, 194.507, 48.1828], 'scale': [1, 1, 1], 'position': [3.83583, 0, -1.52134], 'rotation': [0, 0, 0, 1], 'entityId': '1096', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'},
            {'id': '36e98982-dec8-4355-bff4-415b061f763b', 'type': 'cabinet/floor-based cabinet', 'style': 'Swedish', 'size': [70.7107, 200.0, 37.1576], 'scale': [1, 1, 1], 'position': [2.52976, 0, -1.52137], 'rotation': [0, 0, 0, 1], 'entityId': '1099', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'},
            {'id': '52b76720-4939-4130-baf6-ef38ef8cf4bf', 'type': 'cabinet/floor-based cabinet', 'style': 'Swedish', 'size': [74.7008, 181.602, 45.0665], 'scale': [1, 1, 1], 'position': [5.37781, 0, 0.65282], 'rotation': [0, -0.70711, 0, 0.70711], 'entityId': '1100', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'},
            {'id': 'd2833e1b-efc0-4023-8531-ba5656bdc271', 'type': 'cabinet/floor-based cabinet', 'style': 'Swedish', 'size': [70.7489, 158.0, 44.5825], 'scale': [1, 1, 1], 'position': [1.13593, 0, -1.52137], 'rotation': [0, 0, 0, 1], 'entityId': '1102', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'},
            {'id': '1a235299-e0c0-422c-8d87-0564082d2814', 'type': 'cabinet/floor-based cabinet', 'style': 'Swedish', 'size': [70.7489, 158.0, 44.5825], 'scale': [1, 1, 1], 'position': [5.37781, 0, 1.9309], 'rotation': [0, -0.70711, 0, 0.70711], 'entityId': '1103', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'},
            {'id': 'acff427d-7686-4f02-8e8b-479304302a47', 'type': 'window/window', 'style': 'Contemporary', 'size': [357.772, 243.321, 12.0911], 'scale': [1, 1, 1], 'position': [2.24455, 0.9, 3.16993], 'rotation': [0, 0, 0, 1], 'entityId': '1104', 'unit_to_room': '', 'unit_to_type': ''},
            {'id': '9461e99a-c9c7-42af-8532-13e264859f1f', 'type': 'cabinet/floor-based cabinet', 'style': 'Swedish', 'size': [70.7107, 200.0, 36.9111], 'scale': [1, 1, 1], 'position': [5.24959, 0, -1.52137], 'rotation': [0, -0.38268, 0, 0.92388], 'entityId': '1582', 'group': 'Cabinet', 'role': 'cabinet', 'turn': 0, 'turn_fix': 1},
            {'id': 'aac9cca2-f62c-42dc-98ad-83ce895a5794', 'type': 'cabinet/hutch&buffet', 'style': 'Contemporary', 'size': [70.7108, 200.0, 72.0734], 'scale': [1, 1, 1], 'position': [5.24278, 0, -0.46919], 'rotation': [0, -0.70711, 0, 0.70711], 'entityId': '1583', 'group': 'Cabinet', 'role': 'cabinet', 'relate': 'wall', 'relate_role': 'wall'}
        ]
    },
    "layout_mode": 21,
    "scheme_mode": "group output"
}

# 组合布局接口 测试输入:组合渲染 单批测试
smart_decoration_input_render_test_99 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_item": {
        "id": "item_000",
        "item": "箱",
        "size": [45, 65, 30],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.4, 1.],
        "camera_target": [0, 0.4, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
# 组合布局接口 测试输入:组合渲染 行李箱1
smart_decoration_input_render_test_01 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/4346fd79-f172-457f-a782-7cb74b5af017/v1616040039/scene.json",
    "scene_item": {
        "id": "item_001",
        "item": "箱",
        "size": [60, 100, 30],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.5, 1.5],
        "camera_target": [0, 0.5, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
# 组合布局接口 测试输入:组合渲染 行李箱2
smart_decoration_input_render_test_02 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/336b5843-f355-4d3a-84e8-a8e342a38ea4/v1612859385/scene.json",
    "scene_item": {
        "id": "item_002",
        "item": "箱",
        "size": [60, 100, 30],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.5, 1.5],
        "camera_target": [0, 0.5, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
# 组合布局接口 测试输入:组合渲染 行李箱3
smart_decoration_input_render_test_03 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/46ec8f2c-9685-45da-bd34-71196984f7c4/v1596433237/scene.json",
    "scene_item": {
        "id": "item_003",
        "item": "箱",
        "size": [60, 100, 30],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.5, 1.5],
        "camera_target": [0, 0.5, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
# 组合布局接口 测试输入:组合渲染 行李箱4
smart_decoration_input_render_test_04 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/9a499c2e-8a50-4334-af09-07bd900239eb/v1610348169/scene.json",
    "scene_item": {
        "id": "item_004",
        "item": "冰箱",
        "size": [84, 180, 65],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.8, 2.5],
        "camera_target": [0, 0.8, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
# 组合布局接口 测试输入:组合渲染 化妆品
smart_decoration_input_render_test_11 = {
    "house_id": "", "room_id": "", "house_data": {}, "room_data": {},
    "data_idx": 0, "data_url": "",
    "scene_url": "https://jr-prod-cms-assets.oss-cn-beijing.aliyuncs.com/Asset/336b5843-f355-4d3a-84e8-a8e342a38ea4/v1612859385/scene.json",
    "scene_item": {
        "id": "item_016",
        "item": "化妆品",
        "size": [10, 15, 5],
        "scale": [1, 1, 1],
        "camera_position": [0, 0.10, 0.20],
        "camera_target": [0, 0.10, 0]
    },
    "layout_number": 2, "propose_number": 3, "layout_mode": 10,
    "render_mode": "object original result",
    "scheme_mode": "frame output render"
}
